[
    {
        "id": "1",
        "name": "ADAMON, Thomas",
        "rank": "Pilot Officer",
        "unit": "RAFVR",
        "comment": "Native from Cordoba. Killed on active service Canada 15th October 1942 (age 24). His Tiger Moth collided with another Moth whilst training. He bailed out landing in a Canadian lake. His body was never found. Commemorated at Ottawa Memorial in Ontario. Son of Robert and Blanche Guppy Adamson.  Left Argentina 22nd August 1940. Member of the Rosario Athletic Club",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2622402/ADAMSON,%20THOMAS"
    },
    {
        "id": "2",
        "name": "ALWOOD, Eric Townley",
        "rank": "Sub.Lieut",
        "unit": "RNVR. HMS Daedalus. Squadron 799. Fleet Air Arm shore airfield at Lee-on-Solent.",
        "comment": "Native from Buenos Aires. Killed on active service 25th January 1946 (age 20) at Royal Navy Air Station HMS Daedalus; his Avro Anson (NK738) collided with a De Havilland Dominie (NR754) at 500 feet whilst making his landing circuit. Son of Willie and Elsie Margaret Alwood, of Buenos Aires, Argentine. Left Argentina 20th October 194",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2438260/ALWOOD,%20ERIC%20TOWNLEY"
    },
    {
        "id": "3",
        "name": "AMOS, Cyril Rowland",
        "rank": "Flying Officer",
        "unit": "RAFVR. RAF Moreton in Marsh, 21 OTU (Pilot)",
        "comment": "Native of the Tigre Delta, Buenos Aires. Worked at the Central Argentine Railway. Killed on active service 31st December 1943 (age 28). Amos had been previously wounded 16/03/1942 on ferry flight from North Africa that crashed in Ireland. His Vickers Wellington (X9666) crashed into a hill near Aberdovey, Merioneth. His remains rest at Merioneth Cemetery. Son of Elsie Maud Victoria and Henry Rowland Amos, (former agricultural expert, BAGSR, of Delta Tigre, Buenos Aires. Argentina). Left Argentina 20th October 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2965052/AMOS,%20CYRIL%20ROWLAND"
    },
    {
        "id": "4",
        "name": "ANCELL, Robert Hasting",
        "rank": "Sgt.",
        "unit": "RAFVR. Squadron 49. Air Gunner at RAF Fiskerton",
        "comment": "Native from Lomas de Zamora.  KIA during night operations over Dortmund, Germany 24/05/1943 (age 39). The Lancaster bomber (ED813), in which he was a crew member, was shot down over Essen. His body was buried at Dusseldorf Cemetery, Nordfriendhof 26th May 1943; taken then to Berlin War Cemetery. Son of Robert Wolfe Ancell and Hilda Susan Ancell, Argentina. Educated at St Andrew's Scots School. (www.sanandres.esc.edu.ar/ ).  left Argentina 1st November 1941. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2036507/ANCELL,%20ROBERT%20HASTING"
    },
    {
        "id": "5",
        "name": "ANSON-MAY, Hugh Douglas",
        "rank": "Sub-Lieut.",
        "unit": "RNVR, Fleet Air Arm, Squadron 833. HMS Avenger",
        "comment": "Native from Buenos Aires, pilot of a Fairey Swordfish I. KIA 15th November 1942 at age 23, aboard escort aircraft carrier HMS Avenger (ex Rio Hudson, ex BAVG-2 (USA)). Killed by the only torpedo fired at HMS Avenger by U-155, east of Gibraltar, and under command of KrvKpt. Adolf Cornelius Piening (Knights Cross). Left Argentina 18th June 1940. Member of the Buenos Aires Cricket and Rugby Club. http://www.bacrc.com/ . Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.uboat.net/allies/merchants/crews/person/10105.html"
    },
    {
        "id": "6",
        "name": "ATKINSON, Wilfred George",
        "rank": "Pilot Office (Flt. Engr.)",
        "unit": "RAFVR, Squadron 161. Flight Engineer at RAF Tempsford",
        "comment": "Native from Buenos Aires. Killed on Active Service, UK 19/10/1944.  Buried in Gorton (Brookfield) Unitarian Churchyard. Left Argentina 4th February 1943..",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2698811/ATKINSON,%20WILFRED%20GEORGE"
    },
    {
        "id": "7",
        "name": "AUSTIN, George Robert",
        "rank": "Pilot Officer",
        "unit": "RAFVR. RAF Turnhouse",
        "comment": "Native from Lomas de Zamora. Killed on active service 10th July 1941. He was flying upside down with his Miles Magister (V1084) and crashed into the ground at Corstorphine, Scotland. Son of George Herbert and Aminta Hannah Austin, of Lomas, Already resident in England from shortly before the outbreak of war. Roll of Honour in the Holy Trinity Chuch, Lomas de Zamora. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2451790/AUSTIN,%20GEORGE%20ROBERT"
    },
    {
        "id": "8",
        "name": "BALL, Melville Henry ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 2 Elementary Flying Training School. (Instructor)",
        "comment": "Native from Rosario, Santa Fé. Killed on active service 12th April 1942 (age 21). His Miles Magister suddenly broke formation and crashed. Worked at the Central Argentine Railway. Son of Sydney Melville Charles and Matilde Josefina Ball. Left Argentina 22nd August 1940. Member of the Rosario Atheletic Club (http://en.wikipedia.org/wiki/Club_Atl%C3%A9tico_del_Rosario). Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2459485/BALL,%20MELVILLE%20HENRY"
    },
    {
        "id": "9",
        "name": "BARBER, Trevor Shenfield",
        "rank": "Lieut.",
        "unit": "Royal Engineers. 1004 Docks Operating Coy.",
        "comment": "Son of Claude Cecil and Emily Vincent Barber, of Haslemere, Surrey. Died Egypt 14/01/1944 (age 34)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2896704/BARBER,%20TREVOR%20SHENFIELD"
    },
    {
        "id": "10",
        "name": "BARKER, Harry Kenneth",
        "rank": "Sgt.",
        "unit": "RAFVR",
        "comment": "Missing in action 17th May 1943 (age 28). Son of Harry and Caroline C. Barker, of Edgware, Middlesex. Commemorated at the Runnymede Memorial. Left Argentina 15th November 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1083352/BARKER,%20HARRY%20KENNETH"
    },
    {
        "id": "11",
        "name": "BARNFATHER, Douglas Allen",
        "rank": "Sgt.Gunner",
        "unit": "RAFVR. 106 Sqdn.",
        "comment": "Native from Banfield, Buenos Aires. His Lancaster (ED303) went missing in action 28th July 1943S over Hamburg. On the same flight was Sgt Francisco Backhouse) from Concepción, Chile. Son of Thomas and Nora Barnfather, of Banfield, Argentine. Died UK 28/07/1943 (age 25). Educated at St Andrew's Scots School. (www.sanandres.esc.edu.ar/ ). Left Argentina 16th March 1941. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1083401/BARNFATHER,%20DOUGLAS%20ALLEN"
    },
    {
        "id": "12",
        "name": "BEAUMONT, Arturo",
        "rank": "Flight Sergeant",
        "unit": "RAFVR. 55 Sqdn.",
        "comment": "Native from Argentina. Killed in action over Italy 18th October 1943 flying Martin Baltimore Bombers. Left Argentina 22nd August 1940 ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2608151/BEAUMONT,%20ARTURO"
    },
    {
        "id": "13",
        "name": "BENNETT, Eric",
        "rank": "Sgt.",
        "unit": "RAFVR. 620 Sqdn.",
        "comment": "Native of Buenos Aires. Killed in action 4th February 1944 (age 31). His Stirling Mk IV was hit by German flak northwest of Bourges, France. Left Argentina 6th October 1941.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2695352/BENNETT,%20ERIC"
    },
    {
        "id": "14",
        "name": "BENTLEY, Lennard ",
        "rank": "Marine",
        "unit": "Royal Marines. 30 Assault Unit.",
        "comment": "Native of Buenos Aires. Killed in action, France, 11th June 1944 (age 20). Son of Frederic Robinson Bentley and Dorry Juliet Bentley, of Buenos Aires, Argentina. Educated at St Andrew's Scots School. (www.sanandres.esc.edu.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2955455/BENTLEY,%20LENNARD"
    },
    {
        "id": "15",
        "name": "BLAKE, Robert",
        "rank": "Leading Aircraftman",
        "unit": "RAFVR. OTU Pilot",
        "comment": "British resident in Argentina. Killed in a flying accident 24th July 1941 (age 24). Son of Member of the Buenos Aires Cricket and Rugby Club. http://www.bacrc.com/. Left Argentina 29th January 1941",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2692245/BLAKE,%20ROBER"
    },
    {
        "id": "16",
        "name": "BONNER, George Arnold ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. OTU pilot in Chad, Africa.",
        "comment": "Native from Buenos Aires. Killed on active service, Chad, 14th July 1942 (age 26). Son of G. Cecil and Margaret Bonner, of Buenos Aires, Argentina.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2626785/BONNER,%20GEORGE%20ARNOLD"
    },
    {
        "id": "17",
        "name": "BOSWELL, Robert McBain",
        "rank": "Sgt.",
        "unit": "RAFVR. RAF Foulsham, Norfolk. 180 Sqdn.",
        "comment": "Native of Vera, Santa Fé, Argentina. Missing in action 27th February 1943 (age during operations over enemy territory. North American Michell bomber pilot. Son of Charles Niven Boswell and Mary McBain Boswell, of Vera, Santa Fe, Argentina. ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1530131/BOSWELL,%20ROBERT%20MCBAIN"
    },
    {
        "id": "18",
        "name": "BOYD, Alan Conyngham ",
        "rank": "Capt.",
        "unit": "Royal Corps of Signals",
        "comment": "Son of Robert A. Boyd and Rose Boyd. Died Lybia 15/08/1943 (age 41)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2168322/BOYD,%20ALAN%20CONYNGHAM"
    },
    {
        "id": "19",
        "name": "BOYER, Norman Louis ",
        "rank": "Major",
        "unit": "Royal Warwickshire Regiment",
        "comment": "Born in Argentina, Estancia \"Alta Ongamira\", Cordoba. (Born 20th Nov 1907, son of Olga Alberta Schiele and Louis Joseph Boyer, deceased Stores Superintendent, Buenos Ayres Great Southern Railway) husband of Phoebe Wilhelme Boyer née Philpott, of Little Puxted. Brenchley, Kent. Winner of the King's Medal, Bisley, 1934. Died in the Sudan 10th Nov 1941 (age 34). Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2540378/BOYER,%20NORMAN"
    },
    {
        "id": "20",
        "name": "BRADBURY, Frederick Shaw ",
        "rank": "Flying Officer",
        "unit": "RAFVR",
        "comment": "Native from Lomas de Zamora, Buenos Aires. Killed in a flying accident 21st June 1944 (age 23). His Short Stirling MK III (EH940) caught fire during his first solo flight at 1800 feet and crashed at Park Fram, Kettlehorpe, Lincolshire. Worked at the Buenos Ayres Great Southern, Western & Midland Railways. Son of Francis Home Bradbury and Alice O'Keeffe Bradbury, of Lomas De Zamora, F. C. Sud, Argentina. Left Argentina 22nd August 1940. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery. Educated at St Alban’s College – Lomas de Zamora – (http://www.stalbans.com.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2436714/BRADBURY,%20FREDERICK%20SHAW"
    },
    {
        "id": "21",
        "name": "BRIDGER, David Bruce ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 164 Sqdn. (Argentine British Squadron)",
        "comment": "Native from Lomas de Zamora, Buenos Aires. Killed on active service 23rd August 1942 (age 21). Buenos Ayres Great Southern, Western & Midland Railways. His Spitfire Mk I (P9563) crashed into the ground during a training exercise in Skeabrae, Scotland. Son of Alexander George and Adeline Bruce Bridger, of Lomas de Zamora, Buenos Aires, Argentina. Died UK 23/08/1942 (age 21). Left Argentina 23rd December 1940. Roll of Honour in the Holy Trinity Church, Lomas de Zamora also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery. Educated at St Alban’s College – Lomas de Zamora – (http://www.stalbans.com.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2460714/BRIDGER,%20DAVID%20BRUCE"
    },
    {
        "id": "22",
        "name": "BUDLER, John Frederick Cartwright ",
        "rank": "Driver",
        "unit": "Royal Army Service Corps",
        "comment": "Died at Hatfield House (Military Hospital) 13th December 1943 (age 43).Son of William Henry Budler, and of Beatrice Christine Budler (nee Cartwright). Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2932786/BUDLER,%20JOHN%20FREDERICK%20CARTWRIGHT"
    },
    {
        "id": "23",
        "name": "BURTON, John Francis",
        "rank": "Sgt.Pilot",
        "unit": "RAFVR. RAF Upper Heyford. (Pilot of OTU 16)",
        "comment": "British resident in Buenos Aires. Killed on active service 27th November 1943 (age 20). His Vickers Wellington (BJ823) stalled in a steep bank whilst lining up for a bombing practice run 12 minutes out from the Preston Cape Range. Son of Dorothy Wellby and William J. Burton, (Chief Revenue & Audit Division, Southern, Western and Midland Railways). Leaving Exhibitioner Sutton Valence School for Cambridge University. Left Argentina before the declaration of war. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2436733/BURTON,%20JOHN%20FRANCIS"
    },
    {
        "id": "24",
        "name": "BURTON-CHADWICK, Noel Kenneth  ",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. 202 Sqdn.",
        "comment": "British resident in Buenos Aires. Killed in action 25th April 1942. Son of Sir Robert Burton Chadwick, Bt., and Lady Chadwick (From 1940 to 1947 he was Counsellor to the British Embassy at Buenos Aires, Argentina.); husband of Mary Beatrice Burton-Chadwick, of Colonia, Uruguay, South America. Left Argentina 18th June 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1530937/BURTON-CHADWICK,%20NOEL%20KENNETH"
    },
    {
        "id": "25",
        "name": "CADMUS, George Austen",
        "rank": "Pilot Officer",
        "unit": "RCAFVR. RAF Leeming. 427 Sqdn. (Pilot)",
        "comment": "Native from La Cumbre, Cordoba, Argentina. Killed in action 23rd June 1943 (age 28). Hit by heavy flak flying a Halifax III (DK139) during a night operation over Mulheim. The aircraft crashed in Rheinhausen with no survivors. Son of Thomas Jefferson Cadmus and Sarah Amy Morgan Cadmus, of Reepham, Norfolk. Died Germany 23/06/1943 (age 28). Member of the Buenos Aires Cricket and Rugby Club. http://www.bacrc.com/. Left Argentina 15th February 1941. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2035403/CADMUS,%20GEORGE%20AUSTEN"
    },
    {
        "id": "26",
        "name": "CALDWELL, Hilary Charles  ",
        "rank": "Sqdn. Leader",
        "unit": "RAFVR",
        "comment": "Native of Estancia La Corona, Carlos Casares, Argentina. Killed on active service, Spain, 18th May 1944 (age 43). He was Assistant Air Attaché and pilot of the British Embassy in Madrid. Due to bad weather he crashed into a hill near Tortosa killing himself and Mr Arthur Yenken, British Minister in Spain. Caldwell was a veteran of the two wars. Son of Vere and Louisa Mary Caldwell; husband of Rona V. S. Caldwell, of Bexhill-on-Sea, Sussex. Left Argentina 22nd August 1940. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2814978/CALDWELL,%20HILARY%20CHARLES"
    },
    {
        "id": "27",
        "name": "CAMERON, Allan Reid",
        "rank": "Pilot Officer",
        "unit": "RCAFVR. (Heavy Conversion Unit 1667)",
        "comment": "Native from Buenos Aires. Killed on active service 16th December 1943 (age 27). His Halifax (EB185) was returning to base in bad weather and crashed at RAF Faldingworth. Son of Mr. and Mrs. Alexander A. Cameron; husband of Nora Blanche Cameron, of Buenos Aires, Argentina. Died UK 16/12/1943 (age 27). Member of the Buenos Aires Cricket and Rugby Club. http://www.bacrc.com/. Left Argentina 2nd April 1942",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2703550/CAMERON,%20ALLAN%20REID"
    },
    {
        "id": "28",
        "name": "CAMPBELL, Peter Turner",
        "rank": "Third Engineer Officer",
        "unit": "Merchant Navy S.S.Almeda Star",
        "comment": "Killed in action 17th January 1941 (age 26).  At 05.08 hours on 17 Jan, 1941, U-96 was chasing an unknown steamer that already evaded three G7e torpedoes when the unescorted Almeda Star(Master Harry Cecil Howard, Commodore of the Blue Star Line) was spotted about 35 miles northeast of Rockall. The U-boat then fired a fourth G7e torpedo at the first steamer at 07.10 hours, but it was also evaded and the boat forced to dive by gunfire. At 07.45 hours, U-96 fired one G7e torpedo at the Almeda Star, which stopped after a hit amidships. As the ship did not sink after being hit in the stern and amidships by two coups de grâce at 08.05 and 09.07 hours, the U-boat surfaced to shell the ship. The Germans observed four lifeboats and still saw people on deck before opening fire from 09.32 to 09.48 hours, hitting with about 15 of 28 incendiary shells. Only small fires were started which soon went out, so another torpedo was fired at 09.55 hours. The torpedo hit the forepart and caused her to sink by the bow within three minutes in 58°40N/13°38W. Seven destroyers were ordered to search the area, but found no survivors. The master, 136 crew members, 29 gunners and 194 passengers were lost.  Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes) Son of Alex and Eliza Campbell; nephew of Louie Waters, of Wallsend, Northumberland.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2798275/CAMPBELL,%20PETER%20TURNER"
    },
    {
        "id": "29",
        "name": "CARLETON, Hugh Basil ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. RAF Wigtown. ",
        "comment": "British resident in Buenos Aires. Missing on active service 28th February 1942. His Avro Anson (DG841) ditched 25 miles south of the Isle of Man. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1084008/CARLETON,%20HUGH%20BASIL"
    },
    {
        "id": "30",
        "name": "CARTWRIGHT, Harry Alastair",
        "rank": "Ordinary Seaman",
        "unit": "RNVR. H.M.S. Vervain.",
        "comment": "Native of Olivos, Argentina. Killed on active service 20th February 1945 (age 18). His ship HMS Vervain was topedoed by U-1276 under the command of Oberleutnant zur See Karl-Heinz Wendt, about 25 miles south east of Dungarvon, Ireland. Son of Harry A. G. and Lilian Cartwright, of Rawson, Olivos, Argentina.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2369138/CARTWRIGHT,%20HARRY%20ALASTAIR"
    },
    {
        "id": "31",
        "name": "CASSERLY, José Maria B.",
        "rank": "Pvt",
        "unit": "Army",
        "comment": "Killed in action November 1942, Left Argentina 1940",
        "link": "Activities of the British Community in the Argentine Republic during the 1939 - 1945 war. BCC July 1953"
    },
    {
        "id": "32",
        "name": "CHISHOLM, Gordon Thomas Lister",
        "rank": "Sgt.",
        "unit": "RAFVR. 57 Sqdn. (Air Gunner)",
        "comment": "Native of Cipolletti, Rio Negro, Argentina. Killed in action 23rd November 1942 over Belgium (age 25). His Lancaster MK I (W4360) was shot down by a Bf110 night fighter from the I./NJG4 piloted by Oblt. Ludwig Meister. There were no survivors. Son of Thomas Lister Chisholm and Elsie M. Chisholm, of Cipolletti, Rio Negro, Argentine. Left Argentina 5th October 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2777334/CHISHOLM,%20GORDON%20THOMAS%20LISTER"
    },
    {
        "id": "33",
        "name": "CHURCHOUSE, Geoffrey Keith",
        "rank": "Sub-Lieut.",
        "unit": "RNVR. H.M.S. Golden Hind. (RN Land base in Sydney, Australia)",
        "comment": "Native of Buenos Aires.  Died in a road accident, Japan, 2nd January 1946 (age 26). Son of Sidney William and Nellie Walls Churchouse, of Buenos Aires, Argentina; husband of Sheila Mary Wright Churchouse, of Buenos Aires. ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2207762/CHURCHOUSE,%20GEOFFREY%20KEITH"
    },
    {
        "id": "34",
        "name": "CLARKE, Ciaran Anthony",
        "rank": "Leading Aircraftman",
        "unit": "RAFVR",
        "comment": "British resident in Buenos Aires. Killed on active service, Ireland, 18th November 1941 (age 33). The engine of his Botha (L6195) (http://en.wikipedia.org/wiki/Blackburn_Botha) quit on take-off and crashed into a grove of trees. There were no survivors. Son of Joseph A. and Frances Clarke (nee Doyle), of Bray, Co. Wicklow. Died Ireland ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2701534/CLARKE,%20CIARAN%20ANZLONY"
    },
    {
        "id": "35",
        "name": "COOPER, Noel Wilson ",
        "rank": "Lieut.",
        "unit": "RNVR. H.M.S. Ouebec. (RN Land Base)",
        "comment": "Native of Quilmes, Argentina. Killed on active service Scicily beaches 04/03/1943 (age 29). Son of Reginald and Aileen Evelyn Laura Cooper. Educated at St George's College (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes) and Kings School, Cambridge (http://www.hambo.org/kingscanterbury/view_man.php?id=28). Member of the Buenos Aires Cricket and Rugby Club. http://www.bacrc.com/",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2369804/COOPER,%20NOEL%20WILSON"
    },
    {
        "id": "36",
        "name": "COWARD, Arthur Cecil",
        "rank": "Lieut.",
        "unit": "King's Own Scottish Borderers. attd. 14 Mule Coy. Royal Indian Army Service Corps",
        "comment": "Died in India 09/10/1943 (age 31). Son of Cecil John Griffiths Coward, and of Gabrielle Coward, of Ightham, Kent. Member of the Tigre Boat Club (http://www.tigreboatclub.org.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2191731/COWARD,%20ARTHUR%20CECIL"
    },
    {
        "id": "37",
        "name": "COWARD, Ronald Albert ",
        "rank": "Leading Aircraftman",
        "unit": "RAFVR. (EFTS pilot)",
        "comment": "Native of Basavilbaso, Entre Rios, Argentina. Killed on active service 22/10/1940. His Tiger Moth, in which he was training, crashed into electrical cables. Son of George William Coward, and of Gladys Coward (nee Thompson). Left Argentina 18th June 1940. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2932826/COWARD,%20RONALD%20ALBERT"
    },
    {
        "id": "38",
        "name": "COWLEY, Nathaniel Albert T Rumball ",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. 524 Sqdn (Coastal Command Squadron Pilot)",
        "comment": "Native of Buenos Aires. Killed on Active Service UK 26/11/1944. His Wellington III went missing on a mission over the coast of France. Educated at St Andrew's Scots School. (www.sanandres.esc.edu.ar/). Left Argentina 25th June 1940",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1085110/COWLEY,%20NATHANIEL%20ALBERT%20T%20RUMBALL"
    },
    {
        "id": "39",
        "name": "COWPER-COLES, Richard Henry",
        "rank": "Lieutenant",
        "unit": "RNVR. H.M.S. Despatch",
        "comment": "Died at sea 19th January 1942 (age 37). Crew member of HMS Despatch, he was lost on passage aboard the Canadian S.S. Lady Hawkins when she was torpedoed by the U-66 under the command of Korvettenkapitän Richard Zapp. En route from Montreal to Bermuda she sank about 150 miles from Cape Hatteras. http://uboat.net/allies/merchants/ships/1270.html ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2668223/COWPER-COLES,%20RICHARD%20HENRY"
    },
    {
        "id": "40",
        "name": "CRIBBES, George Deryk ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. (Pilot)",
        "comment": "Native from Buenos Aires. Buenos Ayres Great Southern, Western & Midland Railways. Based in the Bahamas, he was killed in a flying accident 23rd February 1945 (age 24). Son of George Burnett and Sylvia Aida Cribbes, of Buenos Aires, Argentina; husband of Sylvia Mary Cribbes, of Sydenham, London. Left Argentina 5th June 1942. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery. Educated at St Alban’s College – Lomas de Zamora – (http://www.stalbans.com.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2259169/CRIBBES,%20GEORGE%20DERYK"
    },
    {
        "id": "41",
        "name": "DALE, John Albert Harold ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 100 Sqdn.",
        "comment": "Native from Buenos Aires. His Lancaster (EE169) went missing in action on night operations over Hamburg 28th July 1943 (age 33). Son of Gerard Anselm Dale and Marion Dale. Left Argentina 13th November 1941.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/231738/DALE,%20JOHN%20ALBERT%20HAROLD"
    },
    {
        "id": "42",
        "name": "DALY, Michael Thomas ",
        "rank": "Sapper",
        "unit": "Royal Engineers. formerly Royal Northumberland Fusiliers",
        "comment": "Son of Aloysius Joseph and Lena Barlow Daly; nephew of Mr. J. Barlow-Smith, of Chiswick, Middlesex.. Died UK 13th May 1942 (age 28)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2690562/DALY,%20MICHAEL%20THOMAS"
    },
    {
        "id": "43",
        "name": "DARBYSHIRE, Harold Frank ",
        "rank": "2nd Lieut.",
        "unit": "Royal Tank Regiment R.A.C.",
        "comment": "Killed on active service in the Netherlands 21st Oct 1944 (age 25). Son of Gilbert Ramsay Darbyshire and of Maggie Macdonald Darbyshire (nee Grant), of Buenos Aires, Argentine.  Member  of the Tigre Boat Club (http://www.tigreboatclub.org.ar/) and of the Buenos Aires Cricket and Rugby Club (http://www.bacrc.com/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2765640/DARBYSHIRE,%20HAROLD%20FRANK"
    },
    {
        "id": "44",
        "name": "DARLEY, Joseph Harold ",
        "rank": "Pilot Officer",
        "unit": "RAFVR",
        "comment": "Killed on active service 1st September 1941 (age 50). Son of Maj. Henry Read Darley and Emily Henrietta Darley. Left Argentina 29th August 1940. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2422001/DARLEY,%20JOSEPH%20HAROLD"
    },
    {
        "id": "45",
        "name": "DAVIES, Sidney Edward",
        "rank": "Sgt.",
        "unit": "RAFVR, RAF Linton-on-House. 35 Sqdn.",
        "comment": "Native from Buenos Aires. Missing in action 6th June 1942 (age 20). His Halifax B II (R9439) was shot down over Emden, Germany. Son of Arthur Henderson Davies and of Mary Ellen Davies (nee Joyce), Buenos Aires, Argentina. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/231924/DAVIES,%20SIDNEY%20EDWARD"
    },
    {
        "id": "46",
        "name": "DECK, Charles George Frederick ",
        "rank": "Flt.Lieut",
        "unit": "RAFVR. 222 Sqdn.",
        "comment": "Native from Buenos Aires. Killed in action 19th April1945. His Tempest (EJ883) was shot down by German flak over the Neumunster airfield when he was about to attack a flight of JU52s and Ju88s. Son of James and Violet Deck; husband of Pauline Anne Deck, of Shrewsbury, Shropshire. Left Argentina 17th July 1941",
        "link": "http://www.cwgc.org/find-war-dead/casualty/232075/DECK,%20CHARLES%20GEORGE%20FREDERICK"
    },
    {
        "id": "47",
        "name": "DECK, Harold Frederick ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 226 Sqdn.",
        "comment": "Native from Buenos Aires. Killed in action over Germany 26th July 1942 (age 28). Son of Frederick James Deck and of Violet Mabel Deck (nee MacFarlane); husband of Delia Maria Deck, of Tunbridge Wells, Kent. . Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2073680/DECK,%20HAROLD%20FREDERICK"
    },
    {
        "id": "48",
        "name": "DECK, James Frederick ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. RAF Duxford. 56 Sqdn. (Squadron Pilot)",
        "comment": "Native from Buenos Aires. Killed on active service 3rd November 1941 (age 27). His Typhoon (US-L) (R7592) crashed at Roundham near Thetford. Son of Frederick James Deck and Violet Mabel Deck, of Buenos Aires, Argentina. Left Argentina 1st August 1940. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2720547/DECK,%20JAMES%20FREDERICK"
    },
    {
        "id": "49",
        "name": "DEGES, Carl",
        "rank": "Sergeant",
        "unit": "RAFVR, 103 Sqdn. (Air Gnr.)",
        "comment": "Native from Martinez. Killed in action, France 5th August 1941. His Wellingon Mk I (V5656) crashed at Chateu Ledquent, Marquise, Pas de Calais. Son of John and Jane Deges. Killed on Active Service, France 5th August 1941",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2214078/DEGES,%20CARL"
    },
    {
        "id": "50",
        "name": "DIMALOW, Philip Keith ",
        "rank": "Lieut.",
        "unit": "Durham Light Infantry and No. 9 Commando",
        "comment": "Native from Buenos Aires. Killed on Active Service Monte Cassino 3rd February1944 (age 29). Son of James Francis Dimalow and of Marjorie Dimalow (nee Fleming). Educated at St Andrew's Scots School. (www.sanandres.esc.edu.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2069814/DIMALOW,%20PHILIP%20KEITH"
    },
    {
        "id": "51",
        "name": "DRABBLE, Charles Noel ",
        "rank": "Flight Lieut.",
        "unit": "RAFVR",
        "comment": "Native of Buenos Aires. Died Rangoon, Burma 8th Sept 1945 (age 32). Son of Ernest Dorrington Drabble and Margaret Beatrice Drabble. Left Argentina 25th June 1940",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2259902/DRABBLE,%20CHARLES%20NOEL"
    },
    {
        "id": "52",
        "name": "EDGAR, Allan Knowles",
        "rank": "Sgt.",
        "unit": "RAFVR.  RAF Elvington. 77 Sqdn. (Wireless Operater & Air Gunner)",
        "comment": "Native from Buenos Aires. Killed in action 17th April 1943. His Halifax (JB908) caught fire on a night operation over Pilsen. He bailed out but was too low for his parachute to open. Member of the Buenos Aires Cricket and Rugby Club. (http://www.bacrc.com/). Left Argentina 6th September 1940",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2080324/EDGAR,%20ALLAN%20KNOWLES"
    },
    {
        "id": "53",
        "name": "EDWARDS, Dennis Herbert",
        "rank": "Flying Officer",
        "unit": "RAFVR. RAF Aden. 621 Sqdn. (Pilot)",
        "comment": "Missing in action 21st December 1944 during an anti-submarine patrol with a Vickers Wellington Mk III from Coastal Command",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1536554/EDWARDS,%20DENNIS%20HERBERT"
    },
    {
        "id": "54",
        "name": "ELSON, Thomas Peter",
        "rank": "Lieut.",
        "unit": "7th Light Cavalry, I.A.C.",
        "comment": "Killed on active service, Burma, 11th April 1945",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2085370/ELSON,%20THOMAS%20PETER"
    },
    {
        "id": "55",
        "name": "EMERSON, Roderick Stanley (Derick)  ",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. RAF Bourn. 97 Sqdn. (Squadron Pilot)",
        "comment": "Native from Buenos Aires. Killed in action 21st February 1944 (age 28). His Lancaster (JB312) was involved in a mid-air collision whilst leaving the target area of Stuttgart. Badly damaged the aircraft crashed 300 yards short of the runway on return to base.  Son of George and Nellie Emerson; husband of Gwyneth Sybil Emerson, of Hampstead, London. Member of the Buenos Aires Cricket and Rugby Club. (http://www.bacrc.com/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2651074/EMERSON,%20RODERICK%20STANLEY%20(DERICK)"
    },
    {
        "id": "56",
        "name": "ENGLISH, Stanley Charles ",
        "rank": "Able Seaman",
        "unit": "RNVR. H.M.S. Aldenham",
        "comment": "Native of Puerto San Julian, Santa Cruz, Argentina. Killed on active service 14th December 1944 (age 21). Son of John and Doris English, of Puerto San Julian, Argentine.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2669399/ENGLISH,%20STANLEY%20CHARLES"
    },
    {
        "id": "57",
        "name": "EVANS, Frank William Jacob",
        "rank": "POW",
        "unit": "(Executed by the enemy at sea) SS Afric Star",
        "comment": "British resident in Argentina. Shot by a German sailor who sent a volley of shots into the hold where British POWs were being held on the German ship M.V.Portland (http://www.wrecksite.eu/wreck.aspx?31484 (third ship onto which they were transferred). This was due to an ill advised mutiny led by a hot-headed Able Seaman named Fry who, in defiance of his senior officers – Royal Navy and Merchant Navy who were also POWs – attempted to set fire to the Portland with his ad hoc group and through their action set in motion a chain of events that led to the deaths of Frank Evans and Arthur Freeman. Frank’s wife Joan, also an interned passenger on the ship, was finally interned in a German POW camp in Liebenau after going through 10 prison camps. Her daughter Frances was born in this camp and became known as the “First British baby born in a German prison camp” Frances has written a book about her parents experiences, “Quiet Endurance” ISBN 978-987-1601-13-4 (francesbeng@gmail.com).Frank is buried in Bordeaux, France. Afric Star SS was a British Cargo/ Passenger Ship built in 1926 and of 7,438 tons. On the 29th January 1941 she was hit by gunfire from the Hilfskreuzer (Auxiliary Cruiser) M/V Kormoran in a position 08°N - 25°W, approximately (near Cape Verde Islands). She was on a voyage from Buenos Aires and Montevideo to England with a general cargo including butter and frozen meat.",
        "link": " http://www.abcc.org.ar/i-can-forgive-but-i-can-never-forget"
    },
    {
        "id": "58",
        "name": "EWART, William Arnot",
        "rank": "Sgt.",
        "unit": "RAFVR. 142 Sqdn. Squadron Pilot at Fontaine Chaude, Algeria.",
        "comment": "Native from Buenos Aires. Missing in action 16th August 1943. His Wellington went missing on a raid over Viterbo, Italy. Left Argentina 26th October 1940",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1081957/EWART,%20WILLIAM%20ARNOT"
    },
    {
        "id": "59",
        "name": "FAVIER, Ralph Enrique ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. RAF Syerston. 106 Sqdn. (Navigator). Also flew for the Free French Air Force.",
        "comment": "Native from Bahia Blance, Province of Buenos Aires. Killed in action 7th September 1943 (age 25). On night operations over Munich his Lancaster (ED819) crashed out of control in Grunwald, Germany. Son of Enrique Favier and Elisa May Page de Favier; husband of Lily Favier, of Benwell, Newcastle-on-Tyne. Left Argentina 14th July 1941.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2080397/FAVIER,%20RALPH%20ENRIQUE"
    },
    {
        "id": "60",
        "name": "FERGUSON, Robert Thorburn",
        "rank": "Pte",
        "unit": "Queen's Royal Regiment",
        "comment": "Native from Buenos Aires. Killed in action 6th July 1945. Left Argentina 30th November 1941",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2080397/FAVIER,%20RALPH%20ENRIQUE"
    },
    {
        "id": "61",
        "name": "FERNIE, Thomas Edward",
        "rank": "Lieut.",
        "unit": "RNVR. HMS Cromarty",
        "comment": "Lost at sea 23rd October 1943 (age 38). Minesweeper HMS Cromarty. Employee of the Buenos Ayres Great Southern, Western & Midland Railways. Son of Francis Edward and Charlotte Edith Fernie; husband of Celia Nelly Fernie, of Buenos Aires, Argentina. HMS Cromarty (Lt.Cdr. Charles George Palmer, DSC, RNZNVR) was mined and sunk in the Straits of Bonifacio, Mediterranean on 23 October 1943. The Commanding officer was wounded in the sinking. Roll of Honour in the Holy Trinity Church, Lomas de Zamora also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2479092/FERNIE,%20THOMAS%20EDWARD"
    },
    {
        "id": "62",
        "name": "FINCH, Cyril Alan Walter ",
        "rank": "Guardsman",
        "unit": "Scots Guards",
        "comment": "Native of Garruchos, Corrientes, Argentina. Killed in action, France, 6th August 1944 (age 31). Son of Frederick Henry and Dorothy Finch, of Garruchos, Corrientes, Argentina. His brother, Patrick Austen Gwyer Finch, also fell.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2326221/FINCH,%20CYRIL%20ALLAN"
    },
    {
        "id": "63",
        "name": "FINCH, Patrick Austin Gwyer",
        "rank": "Sgt.",
        "unit": "RAFVR. RAF Marham. 115 Sqdn.",
        "comment": "Native from Garruchos, Corrientes. Killed in action 26th March 1942 (age 27). His Wellington Mk III (X3604) (KO-Y) was hit by German flak and crashed at the village of Dieren, near Arnhem, Holland. There were no survivors. Son of Frederick Henry and Dorothy Finch, of Garruchos, Corrientes, Argentina. His brother, Cyril Allan Finch, also died on service. Left Argentina 14th July 1941. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2648352/FINCH,%20PATRICK%20AUSTEN%20GWYER"
    },
    {
        "id": "64",
        "name": "FITZHERBERT, CharlesTrevor Vesey ",
        "rank": "Capt.",
        "unit": "Royal Armoured Corps. 3rd Carabiniers (Prince of Wales's Dragoon Guards)",
        "comment": "Native from Buenos Aires. Worked at Krabbé King & Co. Killed in action, India, 13th April 1944 (age 25). Son of Beresford William and Alice Gwendoline Fitzherbert, of Buenos Aires, Argentine. Member of the Tigre boat Club (http://www.tigreboatclub.org.ar/) and of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/) ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2674550/FITZHERBERT,%20CHARLES%20TREVOR%20VESEY"
    },
    {
        "id": "65",
        "name": "FLOOD, Michael Thomas ",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. RAF Fulbeck. 189 Sqdn.",
        "comment": "Native from Estancia \"El Aguila\", Buena Esperanza, San Luis, Argentina. Killed in action, 4th December 1944 over Germany (age 25). His Lancaster (PB742) was hit by German flak in a night operation over Heilbronn. Son of Thomas Edward and Mary Ida Flood, of El Patria, F.C.P., Argentina. Left Argentina 17th July 1941.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2319734/FLOOD,%20MICHAEL%20THOMAS"
    },
    {
        "id": "66",
        "name": "FLORENCE James",
        "rank": "Civilian War Dead",
        "unit": "SS Avila Star",
        "comment": " Died in lifeboat following sinking by enemy submarine of S.S.Avila Star when torpedoed by the German Submarine U-201, NE of the Azores, in position 38.04N, 22.48W [16]. She was on a voyage from Buenos Aires to Freetown, Sierra Leone with a cargo of 5,659 tons of frozen meat. 5th July 1942 east of Azores. Employee of the Central Argentine Railway. Talleres Gorton Perez, F.C.C.A., Prov. Santa Fe, Argentina. Husband of Emily Nollval Florence, son of Elizabeth Florence of 2 Craigie Loaning, Aberdeen, Scotland.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3167625/FLORENCE,%20JAMES"
    },
    {
        "id": "67",
        "name": "FOOTE, Ernest ",
        "rank": "Driver",
        "unit": "Royal Army Service Corps, 215 Troop Carrying Coy.",
        "comment": "Killed in action, France, 18th Aug 1944 (age 28). Employee of the Buenos Ayres & Pacific Railway. Son of Edgar and May Foote; husband of Betty Catherine Foote, of Tuffley, Gloucester.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2627398/FOOTE,%20ERNEST"
    },
    {
        "id": "68",
        "name": "FORRESTER, Frank Malcom ",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. RAF Imphal. 194 Sqdn. (Navigator/Bomber)",
        "comment": "Killed in action, Burma, 20th June 1945. Member Tigre boat Club (http://www.tigreboatclub.org.ar/) and of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/) Left Argentina 28th May 1941",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2085554/FORRESTER,%20FRANK%20MALCOLM"
    },
    {
        "id": "69",
        "name": "FRANCIS, Robin Keith",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 14 Sqdn.",
        "comment": "Missing in action, Malta, 27th June 1943. Left Argentina November 1939.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1082019/FRANCIS,%20ROBIN%20KEITH"
    },
    {
        "id": "70",
        "name": "FRAZER, Ronald",
        "rank": "Civilian War Dead",
        "unit": "SS Avila Star",
        "comment": "Died in lifeboat following sinking by enemy submarine of S.S.Avila Star when torpedoed by the German Submarine U-201, NE of the Azores, in position 38.04N, 22.48W [16]. She was on a voyage from Buenos Aires to Freetown, Sierra Leone with a cargo of 5,659 tons of frozen meat. 5th July 1942 east of Azores. Son of John Frazer and Helen Frazer (nee McDonald), of Estancia La Colmena, Puerto San Julian (Patagonia), Santa Cruz, Argentina.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3167626/FRAZER,%20RONALD"
    },
    {
        "id": "71",
        "name": "FROST, Harold Sanders",
        "rank": "Able Seaman",
        "unit": "RNVR. H.M.S. President III",
        "comment": "Died on active service 24th January 1941 (age 30). Son of Harold and Ann Eliza Frost, of Weston-super-Mare, Somerset.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2479525/FROST,%20HAROLD%20SANDERS"
    },
    {
        "id": "72",
        "name": "FULLAGER, Francis Hugh ",
        "rank": "Capt.",
        "unit": "Indian Engineers",
        "comment": "Buenos Aires & Pacific Railway. Son of Francis John and Anne Beatrice Fullagar, husband of Dorothy Fullagar, of Edinburgh. Also served in the 1914-18 war. Died UK 29th Nov 1944 (age 46)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2735686/FULLAGAR,%20FRANCIS%20HUGH"
    },
    {
        "id": "73",
        "name": "GAHAN, Laurence Francis",
        "rank": "Civilian War Dead",
        "unit": " SS Avila Star",
        "comment": "Died in lifeboat before rescue (age 27), following the sinking of the Avila Star by the German Submarine U-201, under the command of Kptlt. .Günther Rosenberg., in the Atlantic , on 5 July 1942, NE of the Azores, in position 38.04N, 22.48W [16]. She was on a voyage from Buenos Aires to Freetown, Sierra Leone with a cargo of 5,659 tons of frozen meat. Forty five crew and 17 passengers were lost. Husband of Joan Stenning and father of Jennifer. http://www.bluestarline.org/avila1.html",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3167628/GAHAN,%20LAWRENCE%20FRANCIS"
    },
    {
        "id": "74",
        "name": "GAMMIE, William D. Dewar ",
        "rank": "Lieut.",
        "unit": "Seaforth Highlanders. 5th Bn.",
        "comment": "Killed in action, Tunisia, 22nd March 1943 (age 32). Son of Alexander and Mary Dewar Gammie; husband of Isabel Jane Gammie, of Kinrive, Ross and Cromarty.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2104153/GAMMIE,%20WILLIAM%20DARNLEY%20DEWAR"
    },
    {
        "id": "75",
        "name": "GENTH, Anthony William  ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 25 OTU (Instructor)",
        "comment": "Native from Buenos Aires, home in Cinco Saltos, Rio Negro, Argentina. Killed on active service 11th August 1941 (age 26). He lost control of his Hampden (X2916) during a landing at Finningley. Son of Charles Frederick and Gladys Elvina Genth, of Putney, London. Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2702954/GENTH,%20ANTHONY%20WILLIAM"
    },
    {
        "name": "GILLITT, Frank Norman ",
        "rank": "Flight Lieutenant",
        "unit": "RAFVR.  41 Sqdn",
        "comment": "Native from Buenos Aires, Argentina. Killed In Flying Accident 22 October 1942, aged 23; three Spitfires were lost simultaneously in bad weather, when they flew in formation into Tarren Hendre Hill near Towyn, Menioneth, Wales, killing Flt. Lt. R. Harrison, Flg. Off. T. R. Scott & Flt. Lt. Gillitt; son of Frank S. & Phyllis I. Gillitt of Wellingborough; buried in Block S, Grave 47, of Wellingborough Doddington Road Cemetery, Northamptonshire ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2949679/GILLITT,%20FRANK%20NORMAN"
    },
    {
        "id": "76"
    },
    {
        "id": "77",
        "name": "GITTINS, Harold Bryan Livingston  3) ",
        "rank": "Sergeant",
        "unit": "RCAFVR. 11 OTU (Observer)",
        "comment": "Killed on active service 15th December 1941 (age 24). His Wellington (X3170) dived into the ground near Upton on a night training flight, all were killed. Son of George Leopold Carlyle Gittins and Rosa Elizabeth Magdalene Gittins, of Curumalan, Argentina. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2650822/GITTINS,%20HAROLD%20BRYAN%20LIVINGSTON"
    },
    {
        "id": "78",
        "name": "GODWIN, John",
        "rank": "Lieutenant",
        "unit": "RNVR. HMS Quebec. RN Land Base",
        "comment": "Native of Argentina, killed on Active Service 2nd February 1945 (age 25). British Temporary Lieutenant John Godwin, RNVR (Buenos Aires, 13 December 1919[1] - Sachsenhausen, 2 February 1945) was born and brought up in Argentina, and took part in a raid named Operation Checkmate on Axis shipping near Haugesund, north of Stavanger, Norway.[1] His party managed to sink a minesweeper and a number of steamers using limpet mines, but he was eventually captured with the rest of his party, a commando sergeant, two Naval Petty Officers and three seamen. After spending some time in Grini concentration camp, they were sent to Sachsenhausen concentration camp, where contrary to the Geneva Convention, they were forced to march thirty miles a day on cobbles testing army boots.On 2 February 1945 they were led to execution, in accordance with Hitler's Commando Order of 1942. Godwin managed to wrestle the pistol of the firing party commander from his belt and shot him dead before being himself shot. No superior officer witnessed this act so a decoration could not be awarded. However, his bravery was mentioned in dispatches (posthumously). The citation, in The London Gazette, 9 October 1945, read: \"For great gallantry and inspiring example whilst a prisoner of war in German hands in Norway and afterwards at Sachsenhausen, near Oranienburg, Germany, 1942-1945\".[2] . Son of Charles Algernon and Eva Mary Godwin, of Buenos Aires, Argentina.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2463980/GODWIN,%20JOHN"
    },
    {
        "id": "79",
        "name": "GREGG, Charles Richard Patrick  3)",
        "rank": "L.Cpl",
        "unit": "Royal Armoured Corps. Sqn. 7th Queen's Own Hussars",
        "comment": "Killed in action, Italy, 3rd January 1945 (age 25).  Son of Robert Bonthron Gregg and Muriel Agnes Gregg, of Hurlingham, Argentina.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1717268/GREGG,%20CHARLES%20RICHARD%20PATRICK"
    },
    {
        "id": "80",
        "name": "HALL, George Barton Parker",
        "rank": "Lieut.",
        "unit": "RNVR. H.M.S. Avenger.",
        "comment": "Killed on active service 15th November 1942. Son of Aubrey George and Celia Hall; husband of Audrey Gertrude Muriel Hall. After taking part in the Operation Torch landings of North Africa in November 1942, HMS Avenger departed Gibraltar with convoy MKF 1 on 14 November, heading home to the Clyde in the UK. At 0305 on 15 November, Avenger was torpedoed by U-155. Avenger (Cdr. Anthony Paul Colthurst, DSO, RN) was hit on the port side amidships, which in turn ignited her bomb room, blowing out the centre section of the ship. Her bow and stern sections rose in the air and sunk within 2 minutes in position 36º15'N, 07º45'W, leaving only 12 survivors. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2468057/HALL,%20GEORGE%20BARTON%20PARKER"
    },
    {
        "id": "81",
        "name": "HAMILTON, William",
        "rank": "Civilian War Dead",
        "unit": "M.V.Upway Grange",
        "comment": "Died at sea 8th August 1940 (age 34). The motorship Upwey Grange, Capt. W. E. Williams, on a voyage from Buenos Aires to London, was approximately 200 miles W. of Achill Head, Co. Mayo, on August 8th, 1940, when she was attacked by a German submarine (U37). At about 9.50 a.m. she was struck by two torpedoes in quick succession, both on the port side, the first exploding in the engine room and the second in way of No. 6 hatch. The vessel settled by the stern with a list to port and orders were given to abandon ship. Son of Hannah Hamilton, of 449 Govan Road, Glasgow, Scotland.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3168732/HAMILTON,%20WILLIAM"
    },
    {
        "id": "82",
        "name": "HARLAND, John Herbert Gerard ",
        "rank": "Flying Officer",
        "unit": "RAFVR. 514 Sqdn. (Pilot)",
        "comment": "Native from Buenos Aires. Killed in action 20th November 1944 when bombs fom another Lancaster hit his (LM286) destroying it in the target area near Hamburg. Left Argentina 18th May 1941.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2031951/HARLAND,%20JOHN%20HERBERT%20GERARD"
    },
    {
        "id": "83",
        "name": "HARPER, Courtney John  ",
        "rank": "Pilot Officer.",
        "unit": "RAFVR. 82 Sqdn. RAF Bodney",
        "comment": "Native from Cinco Saltos, Rio Negro. Argentina. Missing in action 17th September 1941 (age 25). His Bleinheim (V6086) was shot down during Circus offensive 95, which was an attack on the chemical complex in Matzingarbe. Left Argentina 13th June 1940. Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1799428/HARPER,%20COURTENEY%20JOHN"
    },
    {
        "id": "84",
        "name": "HARRISON, Robert",
        "rank": "Sgt.",
        "unit": "RAFVR. 514 Sqdn. (Air Gunner) RAF Waterbeach",
        "comment": "British resident in Argentina. Killed in action 25th February 1944. Shot down by German flak during night operations over Schweinfurt in Lancaster (DS785). Son of Robert and Isabel Harrison, of West Cornforth, Co Durham. Left Argentina 5th October 1940",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2101803/HARRISON,%20ROBERT"
    },
    {
        "id": "85",
        "name": "HAYES, William Richard",
        "rank": "Civilian War Dead",
        "unit": "S.S. ANDALUCIA STAR",
        "comment": "Died at Sea 6/10/1942 (age 35) when torpedoed by German Submarine U-107 about west of Cape Palmas, Liberia in position 06.380N, 15.46W [19] . She was on a voyage from Buenos Aires, Argentina to the River Mersey, with a cargo of 5374 tons of meat and 32 tons of eggs. Three crew and one passenger were lost.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3167545/HAYES,%20WILLIAM%20RICHARD"
    },
    {
        "id": "86",
        "name": "HENDERSON, John Henry",
        "rank": "Civilian War Dead",
        "unit": "S.S AVILA STAR",
        "comment": "Died at sea 5/07/1942 (age 30) when torpedoed by the German Submarine U-201, NE of the Azores, in position 38.04N, 22.48W [16]. She was on a voyage from Buenos Aires to Freetown, Sierra Leone with a cargo of 5,659 tons of frozen meat. Forty five crew and 17 passengers were lost. Member of the Tigre Boat Club (http://www.tigreboatclub.org.ar/).  http://www.cwgc.org/find-a-cemetery/cemetery/4004364/S.S.%20AVILA%20STAR",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3167631/HENDERSON,%20JOHN%20HENRY"
    },
    {
        "id": "87",
        "name": "HILL, Robert Jame",
        "rank": "Flight Lieutenant",
        "unit": "RAF. RAF Instructor at 13 OTU.",
        "comment": "British resident in Bahia Blanca. Killed on active service 14th March 1941 (age27). His Blenheim MkI crashed into trees at Oulton. In the UK at the beginning of hostilities. RAF regular officer",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2421434/HILL,%20ROBERT%20JAMES"
    },
    {
        "id": "88",
        "name": "HINE, Douglas Alfred )",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. 431 (R.C.A.F.) Sqdn",
        "comment": "Native from Buenos Aires. Killed in action 23rd June 1943 (age 31). His Wellington was shot down by German flak en route to Mulheim. Son of Ernest William Hine, and of Myrtle Gwendoline Hine (nee Millican); nephew of E. Hazel Nelson, of Oxton, Birkenhead. Left Argentina 23rd December 1940. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2047524/HINE,%20DOUGLAS%20ALFRED"
    },
    {
        "id": "89",
        "name": "HOLLAND, John de Beauvoir )",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 183 Sqdn. RAF Tangmere (Pilot)",
        "comment": "Native of Estancia Santa Elena, Ameghino, Prov of Chubut. Died from wounds 11 February 1944 (age 23). His Typhoon (JR260) was shot down in a dogfight with FW 190s from I/JG 26 near St Catherine's Point, Isle of Wight; he bailed out but died from his injuries; the German pilot who shot him down was Feldwebel Wiegand. Son of Capt. Arthur Henry Holland and Valerie L. De Lisle Holland, of St. Elena, Ameghino, Argentine. Left Argentina 14th September 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2723011/HOLLAND,%20JOHN%20De%20BEAUVOIR"
    },
    {
        "id": "90",
        "name": "HOUGH, James",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. 7 Sqdn. RAF Oakington (Bomb Aimer)",
        "comment": "Killed in action 18th November 1943 (age 33). His Lancaster (JA970) disappeared on an air raid over Mannheim. Employee of the Buenos Ayres & Pacific Railway. Left Argentina 25th June 1940. Son of Frederick Henry and Anne Hough, of Glasgow. Died 18th Nov 1943 over Germany (age33)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2101927/HOUGH,%20JAMES"
    },
    {
        "id": "91",
        "name": "HOULDER, Robert George",
        "rank": "Sub-Lieut.",
        "unit": "RNVR. H.M.S. Tana.",
        "comment": "Missing presumed killed 26th February 1946 (age 29). HMS Tana – shore base in Kilindini, Kenya. Son of George Addyman Houlder and Magdalen Frances Houlder, of Borough Green, Kent.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2494555/HOULDER,%20ROBERT%20GEORGE"
    },
    {
        "id": "92",
        "name": "HOWELL, Ernest",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. 138 Sqdn. RAF Tempsford. (Wireless Operator)",
        "comment": "Missing in action 9th November 1944 in a Stirling (LJ993) (NF-M) during SOE Operation Crupper 11 to Norway. Lost at sea due to bad weather. Left Argentina 22nd August 1940. http://www.roll-of-honour.com/Bedfordshire/TempsfordAircrewLost1944.html",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1800595/HOWELL,%20ERNESTO"
    },
    {
        "id": "93",
        "name": "HUDSON-BELL, Thomas Reginald Trevor  0)",
        "rank": "Flight Sergeant",
        "unit": "RCAFVR. 519 (R.A.F.). Sqdn (W.Op./Air Gnr.) and (Band Leader)",
        "comment": "Native from Adrogué, Buenos Aires. Killed on active service 26th August 1943 (age 20). His Hampden (P2118) crashed into a mountain in Ben Loyal, near Tongue (Scottish Highlands) due to bad visibility and a tornado. Son of Thomas and Mary Ines Hudson-Bell, of Buenos Aires, Argentina. Left Argentina 18th May 1941. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes), and also Educated at St Alban’s College – Lomas de Zamora – (http://www.stalbans.com.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2460310/HUDSON-BELL,%20THOMAS%20REGINALD%20TREVOR"
    },
    {
        "id": "94",
        "name": "HUGHES, George Pryce  Mentioned in Despatches",
        "rank": "Flight Lieutenant",
        "unit": "RCAFVR. 105 (R.A.F.) Sqdn.",
        "comment": "Native from Buenos Aires. Killed in action 11th July 1942 (age 29). A Bf109 G-1 from Staffel Jagdgeschwader I, based in Hussum, flown by Officer Herbert Biermann, shot down his Mosquito (G-BS) (DK299) over Denmark. Son of George D. and Hope Julia Hughes, of Buenos Aires, Argentine.Member Tigre boat Club (http://www.tigreboatclub.org.ar/) and of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/). Left Argentina 27th September 1940.  Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2271036/HUGHES,%20GEORGE%20PRYCE"
    },
    {
        "id": "95",
        "name": "HUGHES, Richard Pryce ",
        "rank": "Pilot Officer",
        "unit": "RCAFVR. 10 (R.A.F.) Sqdn",
        "comment": "Native from Buenos Aires. Killed in action 15th April 1942 (age 33). Returning from a mission over Dortmund with two engines on fire, he ordered his crew to bail out whilst he remained at the controls. He began loosing height spiralling downwards, but his Halifax (R9492) stalled into the ground killing him. Son of Pryce Edward and Ethel Bessie Hughes; husband of Jane Elizabeth Gillian Hughes, of Grampound, Cornwall. Left Argentina 27th September 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2736423/HUGHES,%20RICHARD%20PRYCE"
    },
    {
        "id": "96",
        "name": "HUNT, Ernest John",
        "rank": "Civilian War Dead",
        "unit": "Ministry of Labour (Technical Inspector)"
    },
    {
        "id": "97",
        "name": "HUTTON, John Scott )",
        "rank": "Flying Officer",
        "unit": "RAFVR. RAF Westcott. 11 OTU. (Air Bomber)",
        "comment": "Native from Bahia Blanca. Killed on active service 30th December 1942 (age 27). One of the engines on his Wellington (X6981) quit and he crashed into trees in Ashendon. Employee of the Buenos Ayres Great Sothern, Western & Midland Railways. Son of Joseph and Margaret Hutton, of Buenos Aires, Argentine. Member of the Tigre Boat Club (http://www.tigreboatclub.org.ar/) Left Argentina 28th April 1941",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2706759/HUTTON,%20JOHN%20SCOTT"
    },
    {
        "id": "98",
        "name": "HYLAND, Peter Joseph ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 101 Sqdn. (RAF Ludford Magna, Linc)",
        "comment": "Native of Concordia, Entre Rios.  Killed in action 28th July 1944 (age 21). A JU88 (4R+KK) night fighter flown by the German ace and crew (Oblt. Heinz Rokker, Carlos Nugent, Friedrich Wefelmeier) shot his Lancaster down (SR-V2) (LM462) over Orleans at 7,550 ft. The bomber crashed in Reibrechien, France. They were taking part in a 494 aircraft bombing raid over Stuttgart. Son of Harold and Adeline Archer Hyland, of Entre Rios, Argentine. Left Argentina 3rd March 1941. http://www.bbc.co.uk/history/ww2peopleswar/stories/26/a4342826.shtml",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2898872/HYLAND,%20PETER%20JOSEPH"
    },
    {
        "id": "99",
        "name": "INGOUVILLE, Richard Giles  68)",
        "rank": "Leading Airman",
        "unit": "RNVR. (Fleet Air Arm) H.M.S. Saker",
        "comment": "Native of Buenos Aires. Killed on active service 24th July 1943 (age 20) in a flying training accident in Michigan. Son of Peter and Marta B. Ingouville, of Buenos Aires, Argentina. (HMS Saker was a shore based transit accommodation of the Royal Navy during World War II located at various locations near New York, such as Brooklyn and Ashbury Park, New Jersey. It was used by crews picking up ships allocated to the Royal Navy under the provisions of Lend-Lease and by crews sent to collect ships that had been undergoing long term repair/refitting at U.S. dockyards.)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2719805/INGOUVILLE,%20RICHARD%20GILES"
    },
    {
        "id": "100",
        "name": "JACKSON, Leslie  96)",
        "rank": "Craftsman",
        "unit": "Royal Electrical & Mechanical Engineers, 6th Tank Bgde. Workshops",
        "comment": " Died in the UK 24th June 1944 (age 22). Employee of the Buenos Ayres & Pacific Railway. Son of William and Emily Jackson; husband of Dorothy Jackson, of Armthorpe, Yorkshire.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2361863/JACKSON,%20LESLIE"
    },
    {
        "id": "101",
        "name": "JACKSON, Richard Harrison",
        "rank": "Storekeeper",
        "unit": "S.S. Avila Star (London)",
        "comment": "Died at sea 5/07/1942  (age 54) when torpedoed by the German Submarine U-201, NE of the Azores, in position 38.04N, 22.48W [16]. She was on a voyage from Buenos Aires to Freetown, Sierra Leone with a cargo of 5,659 tons of frozen meat. Forty five crew and 17 passengers were lost.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2362203/JACKSON,%20RICHARD%20H"
    },
    {
        "id": "102",
        "name": "JAMES, Edgar Bowen",
        "rank": "Civilian War Dead",
        "comment": "Died of Septecaemia 31st October 1940. Left Argentina October 5th 1940"
    },
    {
        "id": "103",
        "name": "JOHNSTON, James Geddes  ",
        "rank": "Flight Lieutenant",
        "unit": "RAFVR",
        "comment": "British resident in Argentina. Missing in action 23rd January (age 35) on a flight over the North African front. Son of Samuel Alexander and Elizabeth Johnston; nephew of Joseph Johnston, of Dublin, Irish Republic. Left Argentina March 1940",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1810388/JOHNSTON,%20JAMES%20GEDDES"
    },
    {
        "id": "104",
        "name": "JONES, Thomas Rees",
        "rank": "Sgt.",
        "unit": "RAFVR. RAF Dunholme Lodge. 44 Sqdn. (W.Op./Air Gnr.)",
        "comment": "Resident in Quilmes, Buenos Aires. Killed on active service over Holland 29th June 1943 (age 21). His Lancaster (ED307) was shot down by Major Walther Radusch I/NGJ.I over Nuenen, Holland. Son of Thomas A. and Emma Worthing Jones, of Haedo F.C.N.F.D., Sarmiento, Buenos Aires, Argentine.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2617937/JONES,%20THOMAS%20REES"
    },
    {
        "id": "105",
        "name": "JOYCE, David Dudley Plaister ",
        "rank": "Flying Officer",
        "unit": "RCAF. 10Sqdn.  (R.A.F Leeming, Yorks) (Pilot)",
        "comment": "Native from Belgrano, Buenos Aires. Killed in action 2nd June 1942 (age 23). Hit by flak in a Halifax Mk II (W1098) and crashed into the German village of Oeding. Ony one of the crew of seven survived. Son of Dudley Vincent Joyce, and of Gladys Evelyn Joyce (nee Thomas), of Buenos Aires, Argentine. Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2055996/JOYCE,%20DAVID%20DUDLEY%20PLAISTER"
    },
    {
        "id": "106",
        "name": "KEHOE, James Bernard ",
        "rank": "Sgt.",
        "unit": "RAFVR. 148 Sqdn. (Air Gunner)",
        "comment": "Native from San Nicholas, Buenos Aires. Killed in action 24th April 1942. His Wellington Mk I.C. was shot down over Catania, Italy. Left Argentina 1st June 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2076171/KEHOE,%20JAMES%20BERNARD"
    },
    {
        "id": "107",
        "name": "KEILLER, Cecil Francis",
        "rank": "Civilian War Dead",
        "unit": "M.V. UPWEY GRANGE",
        "comment": "Died at sea due to enemy action, 8th August 1940 (age 31). The M.V Upwey Grange, under the command of Capt. W. E. Williams, on a voyage from Buenos Aires to London, was approximately 200 miles W. of Achill Head, Co. Mayo, on August 8th, 1940, when she was attacked by a German submarine (U37). At about 9.50 a.m. she was struck by two torpedoes in quick succession, both on the port side, the first exploding in the engine room and the second in way of No. 6 hatch. The vessel settled by the stern with a list to port and orders were given to abandon ship. Son of Mary Keiller, of 52a Oxford Road, Kilburn, Middlesex, and of the late Frederick George Keiller.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3168733/KEILLER,%20CECIL%20FRANCIS"
    },
    {
        "id": "108",
        "name": "KING, Douglas Stuart  (J/4824)",
        "rank": "Pilot Officer",
        "unit": "RCAF.76 Sqdn.",
        "comment": "Native from Buenos Aires. Missing in action 30th December 1940 (age24) on a daylight raid to Brest naval base. His Halifax bomber B II (L9615) was severely hit by flak, and though they got away they had to ditch 20 miles off the Devon coast. Son of Douglas and Inez G. King of Krabbé King & Co and Estancia Ñanderoga, Pila, Prov. Bs As. Left Argentina 27th September 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1802740/KING,%20DOUGLAS%20STUART"
    },
    {
        "id": "109",
        "name": "LAING-MEASON, Gilbert",
        "rank": "Leading Aircraftman",
        "unit": "RAFVR (Pilot U/T)",
        "comment": "Native of El Guanaco, Carlos Casares, Buenos Aires. Killed on active service 26th July 1941 (age 23). Son of Gilbert Laing-Meason and of Thelma Laing-Meason (nee McKean), of Guanaco, F.C.O., Argentina. His brother, Sqdn. Ldr. Patrick Beverley Laing-Meason, D.F.C., also died on service. Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/). Left Argentina 6th August 1940",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2709873/LAING-MEASON,%20GILBERT"
    },
    {
        "id": "110",
        "name": "LAING-MEASON, Patrick.Beverley",
        "rank": "Sqdn. Leader",
        "unit": "RAFVR. (Pilot)",
        "comment": "Native from El Guanaco, Carlos Casares, Buenos Aires. Killed on active service 28th October 1944 (age 25). Was killed when his Spitfire crashed. Son of Gilbert Laing Meason and of Thelma Laing-Meason (nee McKean), of Guanaco F.C.O., Argentine. His brother Gilbert also died on service. Member of the Tigre Boat Club. He left Argentina 6th August 1940. (http://www.tigreboatclub.org.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2735518/LAING-MEASON,%20PATRICK%20BEVERLEY"
    },
    {
        "id": "111",
        "name": "LE BAS, Richard Howard ",
        "rank": "Capt.",
        "unit": "Royal Armoured Corps. 3rd King's Own Hussars",
        "comment": "Killed in action North Africa 2nd November 1942 (age 32). Son of Richard Wilson Olavarria Le Bas and Florence Anne Marrs Le Bas, of Rosario, Argentina. Brother of Michael Henry Le Bas later Air Vice Marshall RAF: http://www.rafweb.org/Biographies/LeBas_MH.htm . Member of the Rosario Athletic Club (http://en.wikipedia.org/wiki/Club_Atl%C3%A9tico_del_Rosario)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2123312/LE%20BAS,%20RICHARD%20HOWARD"
    },
    {
        "id": "112",
        "name": "LETT, Charles Maurice (Mono\")  8)",
        "rank": "Flight Sgt.",
        "unit": "RAFVR. 124 \"Baroda\" (F) Sqdn.",
        "comment": "Native from Buenos Aires. Missing in action 30th March 1945. He had to ditch his Spitfire (TB918) off the Norfolk coast. Unfortunately there was a huge spring storm and they were unable to find and rescue him. Left Argentina 14th August 1942. Roll of Honour in the Holy Trinity Church, Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1803346/LETT,%20CHARLES%20MAURICE"
    },
    {
        "id": "113",
        "name": "LINDSELL, Edward Stratton ",
        "rank": "Flying Officer",
        "unit": "RAFVR. 177 Sqdn. (Pilot)",
        "comment": "Native from Buenos Aires. Missing in action over Burma, 5th April 1944 (age 32). Son of Arthur and Frances Lindsell; husband of Molly Lindsell. Left Argentina 13th April 1941",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1815343/LINDSELL,%20EDWARD%20STRATTON"
    },
    {
        "id": "114",
        "name": "LISTER, Edward Udney ",
        "rank": "Flying Officer",
        "unit": "RCAFVR",
        "comment": "Native from Buenos Aires. Killed on active service 10th September 1943 (age 29). Son of Marian Udny Lister, of Buenos Aires, Argentine. Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/).",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2691777/UDNY%20LISTER,%20THOMAS%20EDWARD"
    },
    {
        "id": "115",
        "name": "LYALL-GRANT, Colin  7)",
        "rank": "Lieut.",
        "unit": "RIASC. (Indian Army)",
        "comment": "Killed on active service, India, 27th March 1944. Son of Lt.-Col. Douglas Lyall-Grant, M.C., T.D., and Dorothy Lyall-Grant, of Wimbledon, Surrey. Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2034725/LYALL-GRANT,%20COLIN"
    },
    {
        "id": "116",
        "name": "MacDONALD, Duncan Farquhar ",
        "rank": "Flying Officer",
        "unit": "RAFVR. 160 Sqdn.",
        "comment": "Native from Buenos Aires. Missing on active service, Singapore 6th May 1944 in a Liberator (FL911). Son of Alexander and Ann Macdonald, of Hurlingham, Argentina. Left Argentina 17th July 1941.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1815417/MACDONALD,%20DUNCAN%20FARQUHAR"
    },
    {
        "id": "117",
        "name": "MacDONALD, Kenneth Forbes ",
        "rank": "Sqdn. Leader",
        "unit": "RAFVR. 93 Sqdn. Commanding Officer (Pilot)",
        "comment": "Native from Buenos Aires. Killed in action by DCA (American Anti-Aircraft Fire) over Battipaglia, Italy. 11th September 1943 (age 29). Son of Alexander and Ann Macdonald, of Hurlingham, Argentine. Left Argentina 23rd July 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2603532/MACDONALD,%20KENNETH%20FORBES"
    },
    {
        "id": "118",
        "name": "MacDOUGALL, George ",
        "rank": "Leading Aircraftman",
        "unit": "RAFVR. (Pilot U/T)",
        "comment": "Died Rhodesia 25th September 1941 (age 28). Son of Ronald C. and Evelyn M. C. MacDougall; nephew of Mrs V. 1. MacDougall, of Newbury, Berkshire.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2617028/MacDOUGALL,%20GEORGE"
    },
    {
        "id": "119",
        "name": "MACKINNON, Gordon MacDiarmid",
        "rank": "Flight Sgt.",
        "unit": "RAFVR. 73 Sqdn.",
        "comment": "Native from Buenos Aires. Missing in action, North Africa, 21st October 1942 (age21). His Hurricane Mark I C (BE554) was shot down in a dogfight with German Bf 109s East of Alamein. He was on a tactical reconnaissance patrol when he was attacked. Left Argentina 6th September 1940. Son of Stuart Shaw Mackinnon and Agnes MacDiarmid Mackinnon, of Buenos Aires, Argentina. Member of the Tigre Boat Club (http://www.tigreboatclub.org.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1810698/MACKINNON,%20GORDON%20MACDIARMID"
    },
    {
        "id": "120",
        "name": "MacLEAN, Alexander",
        "rank": "Master",
        "unit": "Merchant Navy (S.S. Corinaldo)",
        "comment": "Died at sea. 6th July 1940 (age 57). At 22.16 hours on October 29, 1942, SS Corinaldo, with a cargo of frozen meat from Buenos Aires, was torpedoed and damaged by U-509 and was abandoned. The position was 33.20N, 18.12W (N of the Canary Islands). The drifting vessel was sunk the next day by U-203 after an abortive attempt by U-659. The master (William Anderson), forty-one crew members and eight DEMS gunners were rescued by the HMS Cowslip and landed at Gibraltar.  Seven crew members and one DEMS gunner lost their lives. The crew members are commemorated on Tower Hill, Panel 31 and the DEMS gunner on the Chatham Naval Memorial (panel 54.3) and the Folkestone War Memorial.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2799855/MACLEAN,%20ALEXANDER"
    },
    {
        "id": "121",
        "name": "MacLEAN, Henry",
        "rank": "Sgt.",
        "unit": "RAFVR. RAF Coningsby. 106 Sqdn. (Air Gunner)",
        "comment": "Killed in action over Denmark, 2nd May 1942 (age 30). His Avro Manchester (L7399) crashed at Lilholt (an earlier twin engined version of the Lancaster). Son of Alexander and Julia Maclean, of Inverness.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2270780/MACLEAN,%20HENRY"
    },
    {
        "id": "122",
        "name": "MacQUEEN, Ian Andrew James )",
        "rank": "Pilot Officer",
        "unit": "RCAF, 44 (Rhodesia) Sqdn.  (Observer)",
        "comment": "Missing in action, 5th Aug 1942. His Lancaster (R-5603) (KM-D) was lost on a bombing raid to the German city of Essen. Employee of the Buenos Ayres Great Southern, Western & Midland Railways. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1079748/MACQUEEN,%20IAN%20ANDREW%20JAMES"
    },
    {
        "id": "123",
        "name": "MACRAE, Evan Macdonald ",
        "rank": "Lt.",
        "unit": "Royal Artillery. 136 Field Regt.",
        "comment": "Native of San Julian, Patagonia, Argentina. Died in Rangoon, 13th September 1945 (age 30).  Son of Evan Macrae and of Doris Macrae (nee Wild), of Budleigh Salterton, Devon; husband of Lucy F. Macrae.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2260865/MACRAE,%20EVAN%20MAC"
    },
    {
        "id": "124",
        "name": "MACRORY, Harry Ian ",
        "rank": "Sgt.",
        "unit": "RAFVR. 23 Sqdn.",
        "comment": "Killed in action in The Battle of Britain 3rd January 1941. (age 21). Son of Harry and Elsie Cousins Macrory, of Penge, Kent. Roll of Honour in the Holy Trinity Church, Lomas de Zamora also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1079768/MACRORY,%20HARRY%20IAN"
    },
    {
        "id": "125",
        "name": "MAITLAND-HERRIOT, Francis Reginald )",
        "rank": "Flight Lieut.",
        "unit": "RAFVR",
        "comment": "Native of Argentina. Killed on active service 1st July 1945 (age 25). Died of serious injuries received in a car accident. Son of Charles Adrian and Dorothy Mary Maitland-Heriot, of West Brompton, London. Member of the Tigre Boat Club (http://www.tigreboatclub.org.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2432614/MAITLAND-HERIOT,%20FRANK%20REGINALD"
    },
    {
        "id": "126",
        "name": "MALLET, Maurice Bradsury  ",
        "rank": "Flight Lieut.",
        "unit": "RAF  (Pilot)",
        "comment": "Killed in action, over Germany 17th September 1942. (Age 25). Son of Thomas Henry Maurice and Florence Mallet; husband of Pamela Mallet, of Paisley, Renfrewshire. In the UK at the beginning of the war as a regular officer.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2617997/MALLET,%20MAURICE%20BRADSURY"
    },
    {
        "id": "127",
        "name": "MANINGTON, David Anthony  1)",
        "rank": "Trooper",
        "unit": "Royal Armoured Corps. 3rd/4th County of London Yeomanry (Sharpshooters)",
        "comment": "Native of Concordia, Entre Rios. Killed in action, Germany 28th March 1945 (age 24). Son of Douglas Charles and Marguerite Louise Manington, of Concordia, Entre Rios, Argentine. ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2040184/MANINGTON,%20DAVID%20ANTONY"
    },
    {
        "id": "128",
        "name": "MARCHANT, Godfrey  MC",
        "rank": "Major",
        "unit": "Intelligence Corps",
        "comment": "Son of Maj. Godfrey Marchant and Frances Elizabeth Mary Marchant. Died Bangladesh 1st April 1945 (age 35)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2180915/MARCHANT,%20GODFREY"
    },
    {
        "id": "129",
        "name": "MARSON, Peter Cramer  3)",
        "rank": "Leading Aircraftman",
        "unit": "RAFVR. (Pilot U/T)",
        "comment": "Native from Cordoba, killed on Active Service, Rhodesia 4th December 1943 (age 22) in an air training accident. Son of Edwin John and Mabel Ethel Marson, of Cordoba, Argentine.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2617421/MARSON,%20PETER%20CRAMER"
    },
    {
        "id": "130",
        "name": "MARTIN, Denys Philip ",
        "rank": "Sgt.",
        "unit": "RAFVR. 78 Sqdn. (Wireless Operator & Air Gunner)",
        "comment": " Killed in action over Germany 24th Aug 1943. On a raid to Berlin a German night fighter shot his Halifax down over Netzow. Employee of the Buenos Ayres Great Southern, Western & Midland Railways. Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2202131/MARTIN,%20DENYS%20PHILIP"
    },
    {
        "id": "131",
        "name": "MATTHEWS, Eric Lycett ",
        "rank": "Capt.",
        "unit": "Suffolk Regiment",
        "comment": "Killed in action, Italy 13th September 1944 (age 27). Son of Edward Lycett Mathews and Lucy Winifred Mathews; husband of Angela Rose Mathews, of Ipswich, Suffolk.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2379073/MATHEWS,%20ERIC%20LYCETT"
    },
    {
        "id": "132",
        "name": "MATTSON, Bertram Knightley  44578)",
        "rank": "Telegraphist/Coder",
        "unit": "RNVR, HMS Kite",
        "comment": "Lost at sea 21st Aug 1944 (age 26). HMS Kite was hit by two torpedoes from U-344 (commanded by Oberleutnant Ulrich Pietsch) and sank in the Barents Sea. Employee of the Central Argentine Railway. Son of Frederick and Gertrude Mattson, of Banbury, Oxfordshire.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2484220/MATTSON,%20BERTRAM%20KNIGHTLEY"
    },
    {
        "id": "133",
        "name": "McALLISTER, Samuel  ",
        "rank": "Flying Officer",
        "unit": "RAFVR. 107 Sqdn. (Pilot)",
        "comment": "Native from the Province of Cordoba. Killed on active service in an air accident with a Blenheim bomber, Malta 16th October 1941 (age 20). Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1704168/McALLISTER,%20SAMUEL"
    },
    {
        "id": "134",
        "name": "McBAY, Arthur Cave  8)",
        "rank": "Sgt.",
        "unit": "RAFVR, 50 Sqdn (Wireless Operator & Air Gunner) RAF Skellingthorpe",
        "comment": "Killed over Germany 26th Feb 1943 (age 26). His Lancaster (ED387) was shot down by German flak on a raid to Nuremberg. Employee of the Central Argentine Railway.Son of William Wilson McBay and Annie McBay, of Rosario, Argentina; husband of Pauline McBay, of Cambridge. Left Argentina 18th June 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2102281/McBAY,%20ARTHUR%20CAVE"
    },
    {
        "id": "135",
        "name": "McCALLUM, Ian Wallace ",
        "rank": "Lieut.",
        "unit": "Royal Armoured Corps. 27th Lancers attd. Popski's Private Army",
        "comment": "Native of Buenos Aires, killied in action Italy, 23rd April 1945 (age 21). Son of William Alexander McCallum and Gwendoline L'Estrange Wallace McCallum, of Buenos Aires, Argentina. Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1716732/McCALLUM,%20IAN%20WALLACE"
    },
    {
        "id": "136",
        "name": "McCOMAS, Henry Claude )",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 26 Sqdn.",
        "comment": "Killed in action, France, 16th July 1942 (age 20). His Mustang was shot down in a dogfight by a Fw 190 over Boulogne. Son of Cyril Henry and Hilda Mary Claude McComas, of Blackrock, Co. Dublin, Irish Republic. M.A. (Cantab.) Caius College. Resident staff at St George's College, Quilmes. (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2278487/McCOMAS,%20HENRY%20CLAUD"
    },
    {
        "id": "137",
        "name": "McDOUGALL, Jeffrey ",
        "rank": "Wing Commander",
        "unit": "RAFVR",
        "comment": "Died 11th December 1942 (age 31). Husband of J. M. McDougall, of Newbury, Berkshire. Citation: One night in November, 1940, Squadron Leader McDougall was the pilot and Sergeant Gray the air gunner of. an aircraft detailed to carry out harassing attacks on enemy aerodromes. At 0300 hours Amiens-Glisy aerodrome was identified and found to be illuminated for night-flying. A large four-engined enemy aircraft was seen in the air and Squadron Leader McDougall decided to attack it before bombing the aerodrome. He rapidly overhauled the enemy and from close range Sergeant Gray opened fire. His first burst entered one of the port engines which immediately emitted smoke. He then fired two long bursts into the fuselage. The aircraft was seen to fall out of control and eventually it hit the ground and exploded. Squadron Leader McDougall then returned to Amiens-Glisy and bombed the aerodrome in the face of intense and accurate anti-aircraft fire. He had completed 22 and Sergeant Gray 26 operational missions, and both have at all times pressed home their attacks with courage and determination.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2421881/McDOUGALL,%20JEFFREY"
    },
    {
        "id": "138",
        "name": "MILTON, Ronald James  . 108105)",
        "rank": "Air Mechanic 2nd Class",
        "unit": "RNVR. HMS Atheling (Aircraft Carrier)",
        "comment": "Native of Buenos Aires. Killed on active service aboard HMS Atheling (aircraft carrier) 29th June 1944 (age20).  Milton and another three mechanics were killed when a  Seafire (MB253) crashed landed, skidded through the retention barrier hitting another Seafire. The Seafire's pilot was unhurt. Son of John and Ida Milton. Left Argentina 17th November 1942. Went to St Andrew's Scots School. (www.sanandres.esc.edu.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2974901/MILTON,%20RONALD%20JAMES"
    },
    {
        "id": "139",
        "name": "MINTER, Edward A.",
        "rank": "Lieut. Commander",
        "unit": "RNVR. H.M.S. Drake (RN Shore Base)",
        "comment": "Native of Argentina. Died of illness 14th January 1942 (age 42). http://www.theminters.co.uk/getperson.php?personID=I159&tree=folkestone",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2811848/MINTER,%20EDWARD%20ARTHUR"
    },
    {
        "id": "140",
        "name": "MITCHELL, Walter Joseph",
        "rank": "Aircraftman 1st Class",
        "unit": "RAFVR",
        "comment": " Killed on Active Service 5th July 1941. He was part of the RAF personnel on the troopship SS Anselm. While transporting 98 crew and 1,210 troops, including 175 Royal Air Force personnel who were heading for the Gold Coast, now Ghana, from Gourock, Scotland, to Freetown, West Africa, (Convoy WS-9B) the ship was struck on the port side by a torpedo from the U-96 (Willenbrock). The ship sank in twenty-two minutes about 300 miles north of the Azores. In the panic and chaos which followed, a total of 254 men, including a large number of the RAF men, were lost. They were in transit from the Clyde to Freetown, Sierra Leone when they were torpedoed about 300 mls N of the Azores (http://members.iinet.net.au/~gduncan/maritime-1.html#maritime_disasters_1941). Employee of the Buenos Ayres Great Southern, Western & Midland Railways. Son of Patrick Charles and Mary Mitchell; husband of Marion Robertson Mitchell, of Harrogate, Yorkshire. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1076981/MITCHELL,%20WALTER%20JOSEPH"
    },
    {
        "id": "141",
        "name": "MOHR-BELL, Harold ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 15 Sqdn.",
        "comment": "Native from San Rafael, Mendoza. Killed in action on the night of the 12th/13th October 1941 during Operation Trinity (http://www.airfieldinformationexchange.org/community/showthread.php?6710-Operation-Trinity-and-the-Baillie-Beam)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2259005/MOHR-BELL,%20HAROLD"
    },
    {
        "id": "142",
        "name": "MONNEY, John Douglas",
        "rank": "Civilian War Dead",
        "unit": "M.V. UPWEY GRANGE",
        "comment": "Died at sea 8th August 19440 (age 35). The motorship Upwey Grange, Capt. W. E. Williams, on a voyage from Buenos Aires to London, was approximately 200 miles W. of Achill Head, Co. Mayo, on August 8th, 1940, when she was attacked by a German submarine (U37). At about 9.50 a.m. she was struck by two torpedoes in quick succession, both on the port side, the first exploding in the engine room and the second in way of No. 6 hatch. The vessel settled by the stern with a list to port and orders were given to abandon ship. Of Estancia Aurora, The Forestal Land, Timber and Railways Company Limited, Argentina. (http://es.wikipedia.org/wiki/La_Forestal). Son of William J. and Anna Monney, of 14 The Rise, Ewell, Surrey.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3168734/MONNEY,%20JOHN%20DOUGLAS"
    },
    {
        "id": "143",
        "name": "MONROE-HINDS, John   ",
        "rank": "Pilot Officer",
        "unit": "RAF. 92 Sqdn. RAF Tangmere",
        "comment": "Native from Buenos Aires. Killed on active service 15th November 1939 (age 23). He crashed whilst training on a Blenheim (L1127). Son of Joseph Albert Monroe Hinds and Mabel Aikens Hinds, of Buenos Aires. Argentina. In the UK before hostilities started he was a regular officer of the RAF. ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2437386/MONROE-HINDS,%20JOHN"
    },
    {
        "id": "144",
        "name": "MOORE, Kenneth Redfern",
        "rank": "Sgt.",
        "unit": "RAFVR. 101 Sqdn. (Navigator)",
        "comment": "Native of Temperley. Killed in action over France 1st February 1945. His bomber crashed due to unknown causes. Member of the Rosario Athletic Club (http://en.wikipedia.org/wiki/Club_Atl%C3%A9tico_del_Rosario). Left Argentina 10th March 1942.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2319859/MOORE,%20KENNETH%20REDFERN"
    },
    {
        "id": "145",
        "name": "MORAWSKI, John  Silver Star ",
        "rank": "Cpl.",
        "unit": "USMC, 14th Def Bn III Phib Corps",
        "comment": "Died of wounds, Guam 22nd July 1944 and was buried at sea. Son of Mrs Gladys Morawski. Educated at St Andrew's Scots School, Buenos Aires. (www.sanandres.esc.edu.ar/), and also Educated at St Alban’s College – Lomas de Zamora – (http://www.stalbans.com.ar/)",
        "link": "Buried at Sea"
    },
    {
        "id": "146",
        "name": "MORRIS, Desmond Edward ",
        "rank": "Flying Officer",
        "unit": "RAFVR, 220 Sqdn.",
        "comment": "Killed in action over the Azores, 4th December 1943. Employee of the Buenos Ayres Great Southern, Western & Midland Railways. ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1077199/MORRIS,%20DESMOND%20EDWARD"
    },
    {
        "id": "147",
        "name": "MURCHISON, James Alexander  8)",
        "rank": "Pvt.",
        "unit": "Queen's Own Cameron Highlanders. 5th Bn.",
        "comment": "Died 3rd July 1944. Member of the Tigre Boat Club (http://www.tigreboatclub.org.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2436992/MURCHISON,%20JAMES%20ALEXANDER"
    },
    {
        "id": "148",
        "name": "NEIL, Charles ",
        "rank": "2nd Lieut.",
        "unit": "Royal Armoured Corps. 22nd Dragoons.",
        "comment": "Native of Buenos Aires. Killed in action in France 11th Sept 1944 (age 20).  Son of Charles Neil and of Lily Neil (nee Orr), of Buenos Aires, Argentine.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2095508/NEIL,%20CHARLES"
    },
    {
        "id": "149",
        "name": "NEILSON, Donald Fullerton  0)",
        "rank": "Flying Officer",
        "unit": "RCAF. RAF Waltham, 550 Sqdn. (Pilot)",
        "comment": "Native from Buenos Aires. Based at RAF Waltham (Grimsby). Went missing in action 17th June 1944 (age 27). Son of Neil Hingle Neilson and Ellen Maud Neilson, of Buenos Aires, Argentina. ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1077575/NEILSON,%20DONALD%20FULLERTON"
    },
    {
        "id": "150",
        "name": "O'CONNOR, John Desmond  98)",
        "rank": "Lance Corporal",
        "unit": "Royal Army Service Corps. attd. H.Q. 4th A.A. Div.",
        "comment": "Died 19th January 1941",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2411855/O'CONNOR,%20JOHN%20DESMOND"
    },
    {
        "id": "151",
        "name": "OLDITCH, Charles Robert  0)",
        "rank": "Trooper",
        "unit": "Royal Armoured Corps",
        "comment": "Native of Argentina. Died UK 1st Oct 1942. Employee of the  Buenos Ayres Great Southern, Western & Midland Railways. Son of Frederick William Olditch and Ethel May Olditch (nee MacLean), of Alta Gracia, Argentina. Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2709287/OLDITCH,%20CHARLES%20ROBERT"
    },
    {
        "id": "152",
        "name": "PANKHURST, Charles Arthur ",
        "rank": "Sgt.",
        "unit": "RAFVR. 207 Sqdn. (Observer)",
        "comment": "British resident in Buenos Aires. Killed in action 24th May 1942 (age 35) in an air accident. Son of Thomas William Pankhurst, and of Flora Pankhurst, of Ewell, Surrey. Left Argentina 25th June 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2441350/PANKHURST,%20CHARLES%20ARTHUR"
    },
    {
        "id": "153",
        "name": "PARKER, Joseph Smith",
        "rank": "A.C.2",
        "unit": "RAFVR",
        "comment": "Employee of the Central Argentine Railway. Taken from the memorial now at The British Cemetery - Chacarita. Was previously at Retiro station."
    },
    {
        "id": "154",
        "name": "PARTINGTON, John Claude  ",
        "rank": "Sgt.",
        "unit": "RAFVR. 9 Sqdn. (Pilot)",
        "comment": "Native from Buenos Aires. Killed in action over Netherlands (age 20).  B.A. (Cantab.). Son of John Laughton Partington and Madeleine Partington, of Buenos Aires, Argentina. His brother, Rene Laughton Partington, also died on active service.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2634822/PARTINGTON,%20JOHN%20CLAUDE"
    },
    {
        "id": "155",
        "name": "PARTINGTON, Rene Laughton ",
        "rank": "Sgt.",
        "unit": "RAFVR. RAF Grimsby 142 Sqdn. (Air Gunner)",
        "comment": "Native from Buenos Aires. Killed in action 6th Oct 1942 (age20). Returning from a mission over Aachen in a Vickers Wellington (BK281) (KT-M). Due to bad weather conditions it crashed on Dartmoor, near Princetown, Devon. Son of John Laughton Partington and Madeleine Partington, of Buenos Aires, Argentina. His brother John Claude also died on active service. Left Argentina before hostilities in 1939.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2651427/PARTINGTON,%20RENE%20LAUGHTON"
    },
    {
        "id": "156",
        "name": "PATTERSON, William Robert Duncan",
        "rank": "Civilian War Dead",
        "unit": "S.S. AVILA STAR",
        "comment": "Died at sea 5/07/1942 (age 29) when torpedoed by the German Submarine U-201, NE of the Azores, in position 38.04N, 22.48W [16]. She was on a voyage from Buenos Aires to Freetown, Sierra Leone with a cargo of 5,659 tons of frozen meat. Forty five crew and 17 passengers were lost. Son of James Patterson, of Mata Grande, San Julian, Argentine, and of the late Elizabeth Patterson",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3167633/PATTERSON,%20WILLIAM%20ROBERT%20DUNCAN"
    },
    {
        "id": "157",
        "name": "PAUL, George Graham ",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. 78 Sqdn. (Navigator)",
        "comment": "Native from Temperley. Killed in action 27th September 1943 (age 22). Shot down in a Halifax Mark II (LW230) (EY-G) which was part of a large bombing raid (678 bombers) over Hanover. Son of Archibald Paul, and of Stella M. Paul, of Temperley, Buenos Aires, Argentine. Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2075083/PAUL,%20GEORGE%20GRAHAM"
    },
    {
        "id": "158",
        "name": "PELLENS, Geoffrey Eugene Martin ",
        "rank": "Lieut.",
        "unit": "Royal Armoured Corps",
        "comment": "Buenos Ayres Great Southern, Western & Midland Railways. Roll of Honour English Social Club Lomas de Zamora and also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery. Educated at St Alban’s College – Lomas de Zamora – (http://www.stalbans.com.ar/)"
    },
    {
        "id": "159",
        "name": "PENNEY, Eric Francis Squire ",
        "rank": "Leading Aircraftman",
        "unit": "RAFVR. (W. Op./Air Gnr.)",
        "comment": "Son of John Ernest and Mary Louisa Penney, of Teignmouth.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2441388/PENNEY,%20ERIC%20FRANCIS%20SQUIRE"
    },
    {
        "id": "160",
        "name": "PERKINS, William",
        "rank": "Sgt.",
        "unit": "RAFVR. (Air Gunner)",
        "comment": "Based at RAF Moreton-in-Marsh, Gloucestershire. Killed on active service 4th January 1943 (age31). His Wellington (W5613) caught fire and crashed in Orchard Leigh Park, near Bath, Somerset. Son of Edwin Perkins, and of Lottie Mary Perkins, of Sale, Cheshire. Left Argentina 14th September 1940",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2691718/PERKINS,%20WILLIAM"
    },
    {
        "id": "161",
        "name": "PILDITCH, Frank Shearburn ",
        "rank": "Lieut.",
        "unit": "Royal Engineers. 241 Field Coy.",
        "comment": " Killed on active service, Germany, 19th March 1945 (age 30). B.Sc. Hons., A.M.I.C.E. Son of Eric and Mary Mitton Shearburn Pilditch; husband of Margaret Mary Pilditch, of Edinburgh.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2041120/PILDITCH,%20FRANK%20SHEARBURN"
    },
    {
        "id": "162",
        "name": "PILLING, James Walter ",
        "rank": "Flight Sgt.",
        "unit": "RAFVR, 202 Sqdn.",
        "comment": " Based in Malta, went missing in action aboard PBY Catalina (AJ162) 10th Sept 1942. Worked at the Buenos Ayres Great Southern, Western & Midland Railways. Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1533032/PILLING,%20JAMES%20WALTER"
    },
    {
        "id": "163",
        "name": "PINSENT, John Soudon",
        "rank": "Sgt.",
        "unit": "RAFVR. 233 Sqdn. (Air Gunner)",
        "comment": "Native of Buenos Aires. Based at RAF Gibralatar, went missing in action in a Lockheed Hudson during an attack against a German submarine on 11th December 1941 (age 25). Son of Gilbert Soudon Pinsent and Agnes Mabel Pinsent, of Buenos Aires, Argentine. Left Argentina 23rd July 1940. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1533034/PINSENT,%20JOHN%20SOUDON"
    },
    {
        "id": "164",
        "name": "PLUNKETT, Oliver Peter ",
        "rank": "Pilot Officer",
        "unit": "RAFVR.",
        "comment": "Killed on active service 16th August 1941 (age 26). Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/). Son of Mr. Justice Oliver Plunkett and Cordelia Esme Plunkett. Left Argentina 23rd July 1940",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2421461/PLUNKETT,%20OLIVER%20PETER"
    },
    {
        "id": "165",
        "name": "POLLOCK, James",
        "rank": "Leading Aircraftman",
        "unit": "RAFVR",
        "comment": "Native of La Plata. Passed away in Buenos Aires due to illness when on leave 8th September 1944 (age 31). Son of William and Myra Pollock of Buenos Aires; husband of Elsie Caroline Pollock (nee Randrup), of La Plata, Argentina. Left Argentina 1st December 1942",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2259488/POLLOCK,%20JAMES"
    },
    {
        "id": "166",
        "name": "POOLE, Thomas Frederick Peter",
        "rank": "Sgt.",
        "unit": "RAFVR. 107 Sqdn. (Observer)",
        "comment": "Killed on active service (age 26) 12th February 1942. Flying in a Boston (AL754) (OM-D) which stalled in a steep bank due to bad conditions on the ground, side slipped and cart wheeled into the woods at RAF Massingham. Son of Arthur John and Kate Poole; husband of Monica Poole, of Horley, Surrey",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2763995/POOLE,%20THOMAS%20FREDERICK%20PETER"
    },
    {
        "id": "167",
        "name": "PRICE, Anthony Frederick ",
        "rank": "Capt.",
        "unit": "Royal Fusiliers (City of London Regiment)",
        "comment": "Killed in action, Italy, 28th Novemebr 1943.Son of Stephen Alfred and Lilian Maud Price, of Westbury-on-Trym, Gloucestershire. Member of the Tigre Boat Club (http://www.tigreboatclub.org.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2376035/PRICE,%20ANTHONY%20FREDERICK"
    },
    {
        "id": "168",
        "name": "PRING, Maurice Arthur Owers  DFM",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 604, 89, 125 and 176 Sqdns.",
        "comment": "British resident in Buenos Aires. Killed in action 5th December 1943 (age 22). His Hurricane (HV709) was shot down over Calcutta by Japanese Navy Zeros from the 33rd Kokutai. Son of Arthur Benjamin Pring and of Doris Lilian Pring (nee Garrett), of Berkhamsted, Hertfordshire",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2192058/PRING,%20ARTHUR%20MAURICE%20OWERS"
    },
    {
        "id": "169",
        "name": "PRYOR, Gerald Cowes ",
        "rank": "Flight Lieut.",
        "unit": "RCAFVR. 18 Sqdn.",
        "comment": "Native of Buenos Aires. Based in Malta, missing in action 8th November 1941. His Blenheim (J/4823) was shot down by anti-aircarft fire when he was attacking an enemy convoy. Son of John W. and Hilda A. Pryor, of Buenos Aires, Argentina. Left Argentina 1940. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1804750/PRYOR,%20GERALD%20COWES"
    },
    {
        "id": "170",
        "name": "RANKIN, John Marquis",
        "rank": "Flying Officer",
        "unit": "RAFVR. 107 Sqdn.",
        "comment": "British resident in Buenos Aires. Killed in action, France, 27th May 1943 (age 32). Son of Frederick John and Grace Fraser Rankin, of Stranraer, Wigtownshire; husband of Edith Margaret Rankin, of Dunfermline, Fife. Member of the Tigre Boat Club (http://www.tigreboatclub.org.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2278722/RANKIN,%20JOHN%20MARQUIS"
    },
    {
        "id": "171",
        "name": "READY, Charles Peter ",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. 103 Sqdn.",
        "comment": "Native from Buenos Aires. Killed in action 2nd December 1943 (age 33) over Berlin. Son of Lt.-Col. Basil Tobin Ready and Hilda Helen Ready, of Hawkhurst, Kent. . Left Argentina 4th March 1941.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2760754/READY,%20CHARLES%20PETER"
    },
    {
        "id": "172",
        "name": "RECABARREN, Raul ",
        "rank": "Sgt.",
        "unit": "RAFVR. 428 (R.C.A.F.) Sqdn (flight Engineer)",
        "comment": "Died from injuries received whilst on an air raid, 26th August 1944. Left September 12th 1942",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2928659/RECABARREN,%20RAUL%20FERNANDO"
    },
    {
        "id": "173",
        "name": "REYNOLDS Geoffrey ´Patoruzú´",
        "rank": "Leading Aircraftman ",
        "unit": "RAFVR. EFTS",
        "comment": "Native of Buenos Aires.  Killed on active service 11th November 1942 (age 28) during a training flight with a Tiger Moth. Son of Mr & Mrs Henry William Reynolds of Buenos Aires..",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2928690/REYNOLDS,%20GEOFFREY"
    },
    {
        "id": "174",
        "name": "REYNOLDS Michael ",
        "rank": "Sgt",
        "unit": "RAF. 106 Sqdn.",
        "comment": "Native of Buenos Aires.  Killed in action 21st December 1942 on an air raid. Son of Mr & Mrs Henry William Reynolds of Buenos Aires.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2689793/REYNOLDS,%20MICHAEL"
    },
    {
        "id": "175",
        "name": "ROANTREE, Ian Landowne ",
        "rank": "Lieut.",
        "unit": "Durham Light Infantry. 9th Bn.",
        "comment": "Son of E. H. and Elena Roantree; husband of Elsie Roantree, of Darlington, Co. Durham. Roll of Honour in the Holy Trinity Church, Lomas de Zamora also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2328791/ROANTREE,%20IAN%20LANSDOWNE"
    },
    {
        "id": "176",
        "name": "ROCHE, Rupert R. Burke ",
        "rank": "Lieut.",
        "unit": "Royal Ulster Rifles. attd. 6th Bn. Royal Inniskilling Fusiliers",
        "comment": "Killed on Active Service, Italy 21st June 1944. Educated at St Andrew's Scots School. (www.sanandres.esc.edu.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1707701/ROCHE,%20RUPERT%20REGINALD%20BURKE"
    },
    {
        "id": "177",
        "name": "RODGER, Thomas Walker",
        "rank": "Sgt.",
        "unit": "RAFVR. 102 Sqdn. Air Gnr.",
        "comment": "Native of Olivos, Buenos Aires. . Killed in action 9th June 1944 (age 29). They were on a mining mission over the German Naval base at Brest in France; the mission was a success, in spite of heavy German flak barrage. On their return to base they were diverted to RAF Catfoss due to bad weather and the Halifax (LW149) under the command of Flying Officer Hillrich crashed into some trees near a farm in Seaton, East Riding of Yorkshire.  Son of Thomas Walker Rodger and Christina Rodger; husband of Mary Dillon Rodger, of Olivos, Buenos Aires, Argentine. Left Argentina on 4th March 1941.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2624075/RODGER,%20THOMAS%20WALKER"
    },
    {
        "id": "178",
        "name": "ROSS, Daniel",
        "rank": "A.C.2",
        "unit": "RAFVR",
        "comment": "Native of Bernal, Buenos Aires.  Killed on Active Service (instruction stage) 11th May 1941 (age 21) during the last German \"blitz\" of the Battle of Britain. Son of Alexander and Eveline Ross, of Bernal, Buenos Aires, Argentina. Educated at St Andrew's Scots School. (www.sanandres.esc.edu.ar/). Left Argentina 1st July 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2928781/ROSS,%20DANIEL"
    },
    {
        "id": "179",
        "name": "RUMBOLL, John Kitchener Plummer. ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 7 Sqdn",
        "comment": "Native from Buenos Aires. Stirling crew at RAF Oakington. Missing in action 21st December 1942 in Stirling (BF358). Shot down over Vold-Vacon, France. Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/). Left Argentina 26th October 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2940711/RUMBOLL,%20JOHN%20KITCHENER%20PLUMMER"
    },
    {
        "id": "180",
        "name": "RUNNACLES, Ernest Ronald Maurice. ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 7 Sqdn. ",
        "comment": "Native from Gral. Lavalle, Prov. Buenos Aires. Son of Maurice Arthur Runnacles and of Margaret Helen Runnacles (nee MacFarlane), of General Lavalle, Buenos Aires, Argentine. Ornithologist. 7 Squadron navigator at RAF Oakington. Killed in action, 11th September 1942 (age 28) in a Short Stirling Mark 1 (W7630) (MG-M). A German night fighter shot thr bomber down over Sittard, Netherlands. The Stirling had taken part in a bomber raid of 479 aircraft on Dusseldorf. Six of the eight crew members were killed. Left Argentina on 4th March 1941. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2646819/RUNNACLES,%20ERNEST%20RONALD%20MAURICE"
    },
    {
        "id": "181",
        "name": "SADLER, Patrick Talbot Scott ",
        "rank": "Capt.",
        "unit": "Royal Armoured Corps. 22nd Dragoons.",
        "comment": " Killed on active service, Germany, 2nd May 1945 (age 35). Son of Robert and Ethel Sadler; husband of Vinnie Toni Sadler, of Horsham, Sussex.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2389827/SADLER,%20PATRICK%20TALBOT%20SCOTT"
    },
    {
        "id": "182",
        "name": "SANDERS, Charles Robert  ",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. 186 Sqdn.",
        "comment": "Native of Temperley. Killed on active service 13th Sept 1943 (age 26). Flying at low level over Shallock in Ayrshire, lost control of Hurricane Mark IV (KZ674) and crashed. Employee of the Buenos Ayres Great Southern, Western & Midland Railways. Son of Charles and Agnes May Sanders, of Buenos Aires, Argentina. Left Argentina 1st July 1940. Roll of Honour in the Holy Trinity Church, Lomas de Zamora also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2455440/SANDERS,%20CHARLES%20ROBERT"
    },
    {
        "id": "183",
        "name": "SANDERSON, Ian Campbell Miles  ",
        "rank": "Flying Officer",
        "unit": "RAFVR. 221 Sqdn.",
        "comment": "Native from Buenos Aires; son of Thomas Sanderson and of Mary Rosaline Sanderson (nee Campbell), of Buenos Aires, Argentine. Killed on active service in an air accident 11th July 1941 (age27).",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2948931/SANDERSON,%20IAN%20CAMPBELL%20MILES"
    },
    {
        "id": "184",
        "name": "SANDYS, John Frederick Kelly ",
        "rank": "Pilot Officer",
        "unit": "RCAF, 75 (R.N.Z.A.F.) Sqdn.",
        "comment": "Native from Buenos Aires. Missing in action on a mission over Kiel, flying Wellington ((X3585), 12th March 1942 (age 25). Employee of the Buenos Ayres Great Southern, Western & Midland Railways. Son of Frederick Robert Kelly Sandys and Beatrice Louisa Sandys, of Bellozanne, Jersey, Channel Islands. Left Argentina 27th September 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2940871/SANDYS,%20JOHN%20FREDERICK%20KELLY"
    },
    {
        "id": "185",
        "name": "SAVA, Kiriacos Pandeli",
        "rank": "Assistant Cook",
        "unit": "SS Stanburn",
        "comment": "Died at sea 27th October 1946. Left Argentina as member of crew s/s \"Empire Envoy\", 7th October 1944, later transfered to the S.S.Stanburn. On October 27th, 1946, whilst the STANBURN was steaming in ballast from Algiers to Sfax, the British cargo S/S Stanburn sank when striking a submerged object North of Kerkenna Bank, off the Tunisian coast.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2804967/SAVA,%20KYRIASOS%20PAMDELI%20H"
    },
    {
        "id": "186",
        "name": "SCHALITZ, Ikey",
        "rank": "Pvt.",
        "unit": "Royal Army Service Corps",
        "comment": "Native of La Plata. Killed on active service, France, 9th October 1944 (age30). Son of Alec and Estella Schalitz; husband of Rose Schalitz, of La Plata, Province of Buenos Aires, Argentine.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2317423/SCHALITZ,%20IKEY"
    },
    {
        "id": "187",
        "name": "SCOFFIELD, Ernest J. Woolerton",
        "comment": "Central Argentine Railway. Taken from memorial now at The British Cemetery - Chacarita. Was previously at Retiro station. Member of the Rosario Athletic Club (http://en.wikipedia.org/wiki/Club_Atl%C3%A9tico_del_Rosario)",
        "link": "Not Found"
    },
    {
        "id": "188",
        "name": "SENIOR, Edward Ronald ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 10 Sqdn.",
        "comment": "Native of Buenos Aires, went missing in action 21st June 1942 on a bombing mission over Emden flying a Halifax (BB201). Member of the Tigre Boat Club (http://www.tigreboatclub.org.ar/) and of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/). Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)  ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2941127/SENIOR,%20EDWARD%20RONALD"
    },
    {
        "id": "189",
        "name": "SHAW, Geoffrey Joseph ",
        "rank": "Capt.",
        "unit": "Royal Fusiliers (City of London Rgt.). attd. 2nd Bn. Argyll and Sutherland Highlanders",
        "comment": "Son of Lt. Max Joseph Shaw, The Royal Fusiliers (City of London Regt.), killed in action, France, 15th September, 1916, and Amy Regina Shaw, of St. John's Wood, London. B.A., Hons. (Oxon.). Killed on active service, Netherlands, 26th Spetember 1944 (age 31)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2081128/SHAW,%20GEOFFREY%20JOSEPH"
    },
    {
        "id": "190",
        "name": "SMITH, Leslie",
        "rank": "Capt.",
        "unit": "Royal Artillery"
    },
    {
        "id": "191",
        "name": "SMITH, Thomas Wilton",
        "rank": "Warrant Officer (Pilot)",
        "unit": "RAFVR. 129 Sqdn.",
        "comment": "Native of Rosario, Santa Fé. Son of Edwin and Jessie Esther Smith, of Rosario de Santa Fe, Argentina. Died of serious injuries as a result of an air accident, 22nd December 1943 (age 24). Left Argentina 22nd August 1944.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2721964/SMITH,%20THOMAS%20WILTON"
    },
    {
        "id": "192",
        "name": "SPANTON, Geoffrey Harold ",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 157 Sqdn. Navigator at RAF Predannack.",
        "comment": "Native of Belgrano, Argentina. Son of Francis Osborn (Cannon) Spanton, and of Dorothy Blanche Spanton, of Westerham, Kent. Formerly St Saviour's Church, Belgrano. MIA 1st December 1943 (age 24) with a Mosquito (HJ656). The plane crashed after being hit by a Junkers 88 from the ZG.1, on patrol over the Vizcaya Gulf. Left Argentina 22nd August 1941. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1807708/SPANTON,%20GEOFFREY%20HAROLD"
    },
    {
        "id": "193",
        "name": "SPREULL, William Harvey ",
        "rank": "Capt.",
        "unit": "Seaforth Highlanders",
        "comment": "Son of Maj. Andrew Spreull, D.S.O., T.D., D.L., M.R.C.V.S., and Effie Moncur Spreull, of Dundee. Died on active service, Tunisia, 6th April 1943 ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2183425/SPREULL,%20WILLIAM%20HARVEY"
    },
    {
        "id": "194",
        "name": "SQUIRE, Walter George ",
        "rank": "Capt.",
        "unit": "Royal Electrical and Mechanical Engineers",
        "comment": "Native of Buenos Aires. Died on active service in Nigeria 26th January 1944 (age 27).  B.Sc. Son of Mrs. N. Squire, of Buenos Aires, Argentine.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2384343/SQUIRE,%20WALTER%20GEORGE"
    },
    {
        "id": "195",
        "name": "STEVENS, Harold ",
        "rank": "Flying Officer",
        "unit": "RAFVR",
        "comment": "Native of Buenos Aires. Son of Mr. and Mrs. Herbert Leslie Stevens; husband of Joan Edith Stevens, of Balneario Solis, Maldonado, Uruguay, of Buenos Aires. Killed on active service 9th September 1943 (age 32). His Avro Anson (LV152) collided against some cables and crashed on a beach in Trevor Point, Wales. Left Argentina 4th March 1941. Roll of Honour in the Holy Trinity Church, Lomas de Zamora also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2716016/STEVENS,%20HAROLD"
    },
    {
        "id": "196",
        "name": "STOCKS, John Malcolm Patrick ",
        "rank": "Capt.",
        "unit": "Royal Sussex Regiment. attd. 82nd Bn. West African Reconnaissance Regiment, R.W.A.F.F.",
        "comment": "Native of Buenos Aires. Killed on active service, Burma, 7th February 1945 . Son of Mr. and Mrs. George Gilbert Stocks, of Buenos Aires, Argentine. ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2526246/STOCKS,%20JOHN%20MALCOLM%20PATRICK"
    },
    {
        "id": "197",
        "name": "STOCKS, Thomas   DFM ",
        "rank": "Sgt.",
        "unit": "RAFVR. 156 Sqdn \"Warboys\". Wireless Operator",
        "comment": "Native of Buenos Aires. Son of Edward and Hannah Stocks, of Doncaster, Yorkshire; husband of Muriel Stocks, of Doncaster. MIA 22nd November 1943 (age 25) in operations over Berlin. His Lancaster (JA984) crashed at Doberitz. Left Argentina 27th June 1940 ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1808066/STOCKS,%20THOMAS"
    },
    {
        "id": "198",
        "name": "STOWER, John Gifford ",
        "rank": "Flight Lieutenant Bomber Pilot",
        "unit": "RCAF Sqdn 420 Waddington and RAF Sqdn 142 Grimsby",
        "comment": "Native from San Salvador de Jujuy. Shot down in his Wellington (BK278) (QT-C) by German flak on a night mission. POW at Stalag Luft III, was executed by the Gestapo under direct orders from Hitler 31st March 1944 along with 49 other escapees (The Great Escape). Went to Brighton College – England http://www.oldbrightonians.com/correspondence/old-brightonian-involved-in-1944-great-escape.html",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2194407/STOWER,%20JOHN%20GIFFORD"
    },
    {
        "name": "MID and 1939 -45 Star Aircrew Europe Star. War Medal 1939 -45 by virtue of his service in World War II"
    },
    {
        "id": "199",
        "name": "SUMNER, Anthony John  LeCouteur ",
        "rank": "Flying Officer",
        "unit": "RAFVR. 103 Sqdn",
        "comment": "Native from Buenos Aires. KIA 26th November 1943. Shot down by flak over Berlin. Left Argentina 4th March 1941. Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2761153/SUMNER,%20ANTHONY%20JOHN"
    },
    {
        "id": "200",
        "name": "SWORD, John Arthur AFC ",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. 115 Sqdn.",
        "comment": "Killed in action 7th May 1942 (age 23). His Wellington (X3591) was hit by German flak during operations over Stuttgart. He bailed out but his parachute failed to open. Son of Arthur and Margaret Sword, of Chivel Norton, Oxfordshire and of Estancia Buena Esperanza, Entre Rios (www.estanciabuenaesperanza.com); husband of Pauline Sword and father of John Sword, of Chipping Norton, Oxfordshire. B.A. (Cantab.). ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2032936/SWORD,%20JOHN%20ARTHUR"
    },
    {
        "id": "201",
        "name": "SYME, John Quintain Thomas",
        "rank": "Sub Lieut.",
        "unit": "RNVR. H.M.S. Pembroke.(Shore Base)",
        "comment": "Died of injuries Mount Vernon Hospital, England, 10th January 1945 (age 43). Left Argentina June 9th 1943. Son of William Smith Syme and Blanche Jenkinson Syme, of Glasgow; husband of Irene Syme, of Fensa, Argentina. B.A. (Cantab.).",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2456200/SYME,%20JOHN%20QUINTAIN%20THOMAS"
    },
    {
        "id": "202",
        "name": "TAYLOR, Alexander Miller Wylie 9)",
        "rank": "Cpl.",
        "unit": "Royal Scots. 8th Bn.",
        "comment": "Native of Buenos Aires. Killed on Active Service Netherlands 13th November 1944 (age 24).Son of John McGarvie Taylor and Ellen Campbell Taylor, of Buenos Aires, Argentina. Educated at St Andrew's Scots School. (www.sanandres.esc.edu.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2766348/TAYLOR,%20ALEXANDER%20MILLER%20WYLIE"
    },
    {
        "id": "203",
        "name": "THOMPSON, Bastian Maitland",
        "rank": "Wing Commander",
        "unit": "RAFVR",
        "comment": "Flew Beaufighters; died when driving under the influence of alcohol July 28th 1945. Brother lives in San Luis. In the UK at the outbreak of the war."
    },
    {
        "id": "204",
        "name": "TRAILL, Anthony ",
        "rank": "Sqdn. Leader",
        "unit": "RAFVR. 45 Sqdn.",
        "comment": "Native of Traill, Santa Fé. Killed near Gauhati, India by intense Japanese antiaircraft fire on 27th January 1944 (age 25)Son of Joseph Edmund and Eileen Edith Audrey Traill, of Traill, Argentine.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2222515/TRAILL,%20ANTHONY"
    },
    {
        "id": "205",
        "name": "TRAILL, James Robert  ",
        "rank": "Flight Lieut.",
        "unit": "RAFVR. 201 Sqdn.",
        "comment": "Native of Argentina. Killed in action 31st July 1942. His Sunderland had taken off from Castle Archdale and appeared without warning and was shot down by friendly AA fire from HMS Hawkins in poor visibility while escorting convoy WS21 at 10:25 hrs. HMS Ledbury was immediately on the scene and rescued Sgt Wheatley - the only survivor. They were escorting shipping into the Clyde Approaches that had been joining what was to become Convoy WS21 in a few days time. Crew of 201 Sqn Sunderland W4025,killed: Rank Name Service: F/Lt. James Robert Traill, RAF F/Lt. Walter Harry Wakefield, RAF P/O. John Allen. RAF F/Sgt. James Andrew Collins, RAF F/Sgt. Maurice John Tomley, RAF Sgt. William Bluck, RAF Sgt. John Robert Goodings, RAF Sgt. Harry Scarce, RAF Sgt. Norman Williams. RAF. Sgt. Clifford Gurnet Fort, RAAF. Sgt. Vivian Lewis. RAAF.Son of John Arthur Edward and Henrietta Margaret Traill, of Putney, London; husband of Greta Noel Traill (nee Lindley). Left Argentina 25th June 1940.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1808983/TRAILL,%20JAMES%20ROBERT"
    },
    {
        "id": "206",
        "name": "TRAILL, Richmond. Campbell Shakespear. )",
        "rank": "2nd Lieut.",
        "unit": "Royal Artillery. 1 Field Regt.",
        "comment": "Native of Argentina. Died on Active Service, Eritrea, 3rd March 1941 (age 26). Son of Robert William and Evelyn Frances Traill, of Bedford.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2272623/TRAILL,%20RICHMOND%20CAMBELL%20SHAKESPEAR"
    },
    {
        "id": "207",
        "name": "TRAILL, Robert Alfred Edmund   Mentioned in Despatches",
        "rank": "Sqdn. Leader",
        "unit": "RAF ",
        "comment": "Native of Argentina. Killed on Active Service 12th March 1941 (age 27). Son of Robert William and Evelyn Francis Traill; husband of Elizabeth Vanda Traill, of Bedford. Mentioned in Despatches",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2709823/TRAILL,%20ROBERT%20ALFRED%20EDMUND"
    },
    {
        "id": "208",
        "name": "TREGEA, James Richard )",
        "rank": "Pilot Officer",
        "unit": "RAFVR. 101 Sqdn",
        "comment": "Native of San Rafael, Mendoza, Argentina. Missing in action on 9th July 1942 (age 20) in a Wellington bomber.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1809004/TREGEA,%20JAMES%20RICHARD"
    },
    {
        "id": "209",
        "name": "TRERY, Charles Ronald",
        "rank": "Flight Lieut.",
        "unit": "RCAFVR, 272 Sqdn (Pilot)",
        "comment": "Native from Hurlingham. Missing in action, Malta, 2nd August 1943 (age 21). His Beaufighter crashed at sea for unknown reasons, two miles east from Prevez, Greece. Son of Leone Ernestine Helene and Charles Herbert Trery, Engineer's Department, Buenos Ayres & Pacific Railway, of O'Higgins 567, Hurlingham, Argentina. Left Argentina 7th September 1941. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1533451/TRERY,%20CHARLES%20RONALD"
    },
    {
        "id": "210",
        "name": "TURNBULL, William",
        "rank": "Sgt. W.Op./Air Gnr.",
        "unit": "RAFVR. 114 Sqdn.",
        "comment": "Native from Belgrano. Killed in action 19th September 1943 (age 30). His Douglas Boston crashed for unknown reasons, Naples, Italy. Son of William and Harriet A. A. Turnbull of Belgrano. Left Argentina 23rd July 1940",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2240184/TURNBULL,%20WILLIAM"
    },
    {
        "id": "211",
        "name": "TYRRELL, Robert Cecil  9)",
        "rank": "Sgt.",
        "unit": "RAFVR, 40 Sqdn.",
        "comment": "Killed in action 15th October 1941 (age 23). His Wellington (X9926) was shot down by a Bf110 over Durnbach en route to Nuremberg. Employee of the Central Argentine Railway. (son of John William Charles Tyrrell and Marion Garrett Tyrrell. J.W.C.Tyrrell was Carriage & Wagon Works manager, FCCA, Rosario, b. 18/01/1884, died B.A. Feb 1952; Marian Tyrrell born 13/03/1888, died B.A. 25/08/1975).",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2103366/TYRRELL,%20ROBERT%20CECIL"
    },
    {
        "id": "212",
        "name": "UDNY-LISTER, Thomas Edward ",
        "rank": "F/O",
        "unit": "RCAF",
        "comment": "Son of Marian Udny Lister, of Buenos Aires, Argentine. Died in an accident flying with an Oxford I on 10th September 1943 - DF262 - 3 (P) AFU (Pilots - Advanced Flying Unit) - dived into the ground at night Dean Farm, Haltherop, near Southrop. There were THREE fatal casualties in this accident. (Age 29)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2691777/UDNY%20LISTER,%20THOMAS%20EDWARD"
    },
    {
        "id": "213",
        "name": "UPTON, Harold Edward 0)",
        "rank": "Cpl.",
        "unit": "Seaforth Highlanders",
        "comment": "Killed on Active Service, Burma 6th April 1944 (age 33) Educated at St Andrew's Scots School. (www.sanandres.esc.edu.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2527810/UPTON,%20HAROLD%20EDWARD"
    },
    {
        "id": "214",
        "name": "VENN, Henry Albert ",
        "rank": "Lieut.",
        "unit": "RNVR. H.M.S. Copra.",
        "comment": "Killed on Active Service HMS Copra (age 29). Son of Vivian and Maria Esther Venn, of Quilmes, F.C.S., Argentina. Member Tigre boat Club (http://www.tigreboatclub.org.ar/). Educated at St Andrew's Scots School. (www.sanandres.esc.edu.ar/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2341641/VENN,%20HENRY%20ALBERT"
    },
    {
        "id": "215",
        "name": "WALLIS, Stanley George ",
        "rank": "Flying Officer",
        "unit": "RAFVR. 217 Sqdn.",
        "comment": "Resident of Lomas de Zamora. Missing on active service, Trincomalee, Ceylon, 26th August 1943. His Beaufort Mk I (DW938) crashed at sea as a result of structural failure during a training flight at Trincomalee, Northwest of Ceylon. Left Argentina 13th April 1943. Roll of Honour in the Holy Trinity Church, Lomas de Zamora also Commemorated in the central stained glass window of the chapel in the Lavallol Cemetery",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1816521/WALLIS,%20STANLEY%20GEORGE"
    },
    {
        "id": "216",
        "name": "WATT, James Stanley DSO ",
        "rank": "Flight Lieut.",
        "unit": "RAFVR, 7 Sqdn",
        "comment": "Native from Cordoba, permanent resident of Buenos Aires. Missing in action 22nd June 1943 (age 21). His Stirling Mk III (R9272) was shot down by Hauptman Walter Millius from NJG3 flying a Bf110. The bomber crashed into the Tzandt Woods near Alphen village in Gilze Rijen, Netherlands. It is presumed that his body has been buried as NN (the remains of the bomber were found in 2004). Son of Charles Alexander Morgan Watt and of Hattie Burdell Watt (nee Benitz), of Buenos Aires, Argentina. Left Argentina 29th January 1941. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1809803/WATT,%20JAMES%20STANLEY"
    },
    {
        "id": "217",
        "name": "WATT, P McGregor  ",
        "rank": "Squadron Leader",
        "unit": "RAF.  49 Sqdn. (Pilot)",
        "comment": "Killed in action 23rd November 1939. Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2358790/WATT,%20P%20McGREGOR"
    },
    {
        "id": "218",
        "name": "WAUD, George Stanley  V)",
        "rank": "Cpl.",
        "unit": "Witwatersrand Rifles/Regiment de la Rey, S.A. Forces",
        "comment": "Died in Egypt 7th March 1944 ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2210104/WAUD,%20GEORGE%20S"
    },
    {
        "id": "219",
        "name": "WEBSTER, John Stafford  0)",
        "rank": "A.C.2",
        "unit": "RAFVR, 36 Sqdn.",
        "comment": "Died in Indonesia 28th May 1943 ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2172198/WEBSTER,%20JOHN%20STAFFORD"
    },
    {
        "id": "220",
        "name": "WELCH, John Ralph Stanley ",
        "rank": "Lieut.",
        "unit": "Royal Armoured Corps, 141st (7th Bn. The Buffs [Royal East Kent Regt.] Regt.",
        "comment": "Son of Ralph Stanley Welch and Kathleen Welch, of Las Tijeras, Las Rosas, F.C.C.A., Argentine. Died France 18th July 1944 (age 24)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2062127/WELCH,%20JOHN%20RALPH%20STANLEY"
    },
    {
        "id": "221",
        "name": "WESTLEY, Guy Napier ",
        "rank": "Lieut.",
        "unit": "York & Lancashire Regt. attd. 1st Bn. Hampshire Regiment",
        "comment": "Son of William Arthur and Lillian Victoria Westley, of Olivos, F.C.C.A., Argentina. Died France 6th June 1944 (age 25). Member of the Buenos Aires Cricket and Rugby Club.  (http://www.bacrc.com/)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2045656/WESTLEY,%20GUY%20NAPIER"
    },
    {
        "id": "222",
        "name": "WHEELER, A. Brian& Bar ",
        "rank": "Wing Commander",
        "unit": "RCAF, 88 (R.A.F.) Sqdn",
        "comment": "Son of Arthur Leslie and Dorothy Maud Wheeler, of Marton, Wellington, New Zealand; husband of Evelyn Margaret (Peggie) Wheeler, of Marton. Died 15th Feb 1944 (age 28)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2846109/WHEELER,%20ARTHUR%20BRIAN"
    },
    {
        "id": "223",
        "name": "WILLANS, Thomas Blair",
        "rank": "2nd Officer",
        "unit": "Air Transport Auxiliary. Ferry unit 41",
        "comment": "Native from Carlos Pellegrini, Buenos Aires. Killed on active service 12th January 1945 (age 41). Died from his injuries when his Wellington (PF986) from Pool 3FPP was hit whilst parked at Dumfries by Anson LV219 of 10 OAFU which overshot the runway. Son of Richard Harte Keatinge Willans and Georgina Blois Willans; husband of Daphne Willans, of Carlos Pellegrini, Argentina. ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2421663/WILLANS,%20THOMAS%20BLAIR"
    },
    {
        "id": "224",
        "name": "WILLIAMS, Paul Charles ",
        "rank": "Flying Officer",
        "unit": "RAFVR, 298 Sqdn.",
        "comment": "Native of Villa Valeria, Cordoba. Killed on active service 27th March 1945 (age 21). Son of Donald Williams and of Evelyn May Williams (nee Gardom), of Villa Valeria, Argentina. Left Argentina 28th September 1939.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2929456/WILLIAMS,%20PAUL%20CHARLES"
    },
    {
        "id": "225",
        "name": "WOOD, Derek Anson ",
        "rank": "Sergeant",
        "unit": "RAFVR, 207 Sqdn.",
        "comment": "Permanent resident of Buenos Aires. Killed on active service 28th March 1942 (age 21). He was co-piloting a Lancaster Mk I (R5501) when they collided with a Miles Master which was on a training flight over Canwick Hill, Lincolnshire. There were no survivors. Son of Ernest Henry Wood and of Mabel Wilkie Wood (nee Simons), of Montevideo, Uruguay.  Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2358692/WOOD,%20DEREK%20ANSON"
    },
    {
        "id": "226",
        "name": "WOOD, Geoffrey Walter   DFM ",
        "rank": "Flight Sgt.",
        "unit": "RAFVR, 97 Sqdn. (Air Gunner)",
        "comment": "Killed in action 21st February 1944 (age 33). Son of George H. Wood and V. R. Sylvia Wood, of Newbury, Berkshire. Left Argentina 31st August 1942",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2651685/WOOD,%20GEOFFREY%20WALTER"
    },
    {
        "id": "227",
        "name": "WOOD, Thomas George",
        "rank": "Flight Sgt.",
        "unit": "RAFVR, 162 Sqdn. (Air Gunner)",
        "comment": "Native from Gral Pinto, Province of Buenos Aires. Missing in action, Egypt, 2nd July 1942 (age 22). Son of Thomas and Kathleen Graham Wood, of Buenos Aires, Argentine.  Educated at St George's College – Quilmes - Argentina (http://en.wikipedia.org/wiki/St._George's_College,_Quilmes)",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1283109/WOOD,%20THOMAS%20GEORGE"
    },
    {
        "id": "228",
        "name": "WORSLEY, Arthur Lesley ",
        "rank": "Pilot Officer",
        "unit": "RAFVR,  RAF Dishforth. 425 (R.C.A.F.) Sqdn.",
        "comment": "Native from Rosario. Missing in action 7th February 1943 (age 22). His Wellington didn't return from a mine laying operation over the Nectarines I area (Frisian Islands off the coasts of Holland, Germany and Denmark). Employee of the Central Argentine Railway.(son of Agnes Elizabeth and William Worsley, Joint Chief Traffic Controller, Central Argentine Railway, Rosario). Left Argentina 18th June 1940",
        "link": "http://www.cwgc.org/find-war-dead/casualty/1532103/WORSLEY,%20ARTHUR%20LESLEY"
    },
    {
        "id": "229",
        "name": "WYLLIE, Charles John  7)",
        "rank": "Warrant Officer",
        "unit": "RCAF, 53 (R.A.F.) Sqdn",
        "comment": "Killed in action 8th May 1942 (age 20). His Lockheed Hudson was shot down over the Netherlands. Son of Charles John and Helen R. Mackenzie Wyllie, of Duggan, Argentine Republic. ",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2034545/WYLLIE,%20CHARLES%20JOHN"
    },

    {
        "id": "230",
        "name": "BECK Ane Alice (Annie)",
        "unit": "Civilian War Dead",
        "comment": "Of 58 Selbourne Street, Attercliffe. (http://en.wikipedia.org/wiki/Attercliffe) Wife of John Beck. Died at 48 Selbourne Street on 15th Dec 1942 (age 65) in a bombing raid.  Reporting authority SHEFFIELD, COUNTY BOROUGH",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3158615/BECK,%20ANN%20ALICE"
    },
    {
        "id": "231",
        "name": "BILLSON, Marjorie",
        "rank": "Nursing Service",
        "unit": "Died on Service"
    },
    {
        "id": "232",
        "name": "BOTHAM, Dorothy",
        "rank": "Nurse Brit. Hospital",
        "unit": "Civilian War Dead.  S.S.Avila Star",
        "comment": "Died at sea 5/07/1942 (age 34) when torpedoed by the German Submarine U-201, NE of the Azores, in position 38.04N, 22.48W [16]. S.S.Avila Star.was on a voyage from Buenos Aires to Freetown, Sierra Leone with a cargo of 5,659 tons of frozen meat. Forty five crew and 17 passengers were lost.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3167622/BOTHAM,%20DOROTHY"
    },
    {
        "id": "233",
        "name": "FRAZER, Norah Helen",
        "unit": "Civilian War Dead.  S.S.Avila Star",
        "comment": "Died at sea 5/07/1942 (age 23) when torpedoed by the German Submarine U-201, NE of the Azores, in position 38.04N, 22.48W [16]. The S.S.Avila Star was on a voyage from Buenos Aires to Freetown, Sierra Leone with a cargo of 5,659 tons of frozen meat. Forty five crew and 17 passengers were lost. Daughter of John and Helen Frazer, of Estancia La Colmena, Puerto San Julian (Patagonia), Santa Cruz, Argentina.",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3167627/FRAZER,%20THELMA%20NORAH"
    },
    {
        "id": "234",
        "name": "JENNINGS, Marcelina",
        "unit": "Civilian War Dead.  S.S. Vaalaren",
        "comment": "Died at sea 5th Apr 1943 (age 26). The S.S.Vaalaren (a Swedish Motor Vessel) was part of the convoy HX231 crossing the North Atlantic on her return voyage to England when she was torpedoed by the U-229 off the South Coast of Greenland",
        "link": "http://www.cwgc.org/find-war-dead/casualty/3168738/JENNINGS,%20MARCELINA"
    },
    {
        "id": "235",
        "name": "JENNINGS, Iris Mabel",
        "unit": "Civilian War Dead"
    },
    {
        "id": "236",
        "name": "JUNG, Penelope Kathleen (Paddy)  3)",
        "rank": "Aircraftwoman 2nd Class",
        "unit": "WAAF",
        "comment": "Daughter of H. Francis Jung and of Rosalynd Annie Jung (nee Smithe), of Castelar, F.C. Oeste, Argentina. Died suddenly of Uremia at Victoria Hospital, Blackpool, England, 11th Dec 1943 (age 21). Left Argentina May 26th 1943",
        "link": "http://www.cwgc.org/find-war-dead/casualty/2697662/JUNG,%20PENELOPE%20KATHLEEN%20(PADDY)"
    },
    {
        "id": "237",
        "name": "SUTTON, Phyllis Edith",
        "unit": "Civilian War Dead.  S.S.Avila Star",
        "comment": "Died at sea 5/07/1942  (age 34) when torpedoed by the German Submarine U-201, NE of the Azores, in position 38.04N, 22.48W [16]. The S.S.Avila Star  was on a voyage from Buenos Aires to Freetown, Sierra Leone with a cargo of 5,659 tons of frozen meat. Forty five crew and 17 passengers were lost. Daughter of Edith Maude Sutton, of Navarro 4145, Buenos Aires, Argentina, and of the late Harry William Sutton"
    }
]